{
  "ir_version": "0.1.0",
  "design": {
    "name": "mem_addr_cond_project",
    "modules": [
      {
        "id": 0,
        "name": "mem_addr_cond_test",
        "base_module_id": -1,
        "source_line": 53,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 55,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 56,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "addr_a",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 57,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "addr_b",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 58,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "result",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 59,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 5,
          "name": "state",
          "kind": "register",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 63,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 2 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 6,
          "name": "data_out",
          "kind": "register",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 64,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 200000,
          "name": "rom_read_addr",
          "kind": "register",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 4 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [200000, 5, 6],
            "reset_signal_id": 1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 77, "condition": { "kind": "logical_not", "width": 1, "source_line": 77, "operand": { "kind": "signal_ref", "width": 1, "source_line": 77, "signal_id": 1 } }, "then": { "kind": "block", "source_line": 77, "statements": [{ "kind": "assignment", "id": 7, "source_line": 77, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 200000, "is_sliced": false, "rhs": { "kind": "literal", "width": 4, "source_line": 77, "literal": { "value": 0, "width": 4 } } }, { "kind": "assignment", "id": 8, "source_line": 77, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 2, "source_line": 77, "literal": { "value": 0, "width": 2 } } }, { "kind": "assignment", "id": 9, "source_line": 77, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 77, "literal": { "value": 0, "width": 8 } } }] }, "else": { "kind": "block", "source_line": 77, "statements": [{ "kind": "select", "source_line": 84, "selector": { "kind": "signal_ref", "width": 2, "source_line": 84, "signal_id": 5 }, "cases": [{ "case_value": { "kind": "literal", "width": 2, "source_line": 85, "literal": { "value": 0, "width": 2 } }, "body": { "kind": "block", "source_line": 85, "statements": [{ "kind": "assignment", "id": 0, "source_line": 86, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 200000, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 4, "source_line": 86, "signal_id": 2 } }, { "kind": "assignment", "id": 1, "source_line": 87, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 2, "source_line": 87, "literal": { "value": 1, "width": 2 } } }] } }, { "case_value": { "kind": "literal", "width": 2, "source_line": 89, "literal": { "value": 1, "width": 2 } }, "body": { "kind": "block", "source_line": 89, "statements": [{ "kind": "assignment", "id": 2, "source_line": 90, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "mem_read", "width": 8, "source_line": 90, "memory_name": "rom", "port_name": "read", "address": null } }, { "kind": "assignment", "id": 3, "source_line": 91, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 200000, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 4, "source_line": 91, "signal_id": 3 } }, { "kind": "assignment", "id": 4, "source_line": 92, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 2, "source_line": 92, "literal": { "value": 2, "width": 2 } } }] } }, { "case_value": { "kind": "literal", "width": 2, "source_line": 94, "literal": { "value": 2, "width": 2 } }, "body": { "kind": "block", "source_line": 94, "statements": [{ "kind": "assignment", "id": 5, "source_line": 95, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 2, "source_line": 95, "literal": { "value": 0, "width": 2 } } }] } }, { "case_value": null, "body": { "kind": "block", "source_line": 97, "statements": [{ "kind": "assignment", "id": 6, "source_line": 98, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 2, "source_line": 98, "literal": { "value": 0, "width": 2 } } }] } }] }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
          {
            "id": 0,
            "name": "rom",
            "type": "BLOCK",
            "word_width": 8,
            "depth": 16,
            "address_width": 4,
            "init_literal": { "value": 0, "width": 8 },
            "ports": [
              { "name": "read", "kind": "READ_SYNC", "address_width": 4, "data_out_signal_id": 6, "sync_clock_domain_id": 0 }
            ]
          }
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 73, "statements": [{ "kind": "assignment", "id": 0, "source_line": 74, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 74, "signal_id": 6 } }] }
      }
    ],
    "project": {
      "name": "mem_addr_cond_project",
      "clocks": [
        { "name": "clk", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "clk", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "rst_n", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "addr_a", "kind": "IN", "width": 4, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "addr_b", "kind": "IN", "width": 4, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "result", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "clk", "bit_index": -1, "board_pin_id": "1" },
        { "logical_pin_name": "rst_n", "bit_index": -1, "board_pin_id": "2" },
        { "logical_pin_name": "addr_a", "bit_index": 0, "board_pin_id": "3" },
        { "logical_pin_name": "addr_a", "bit_index": 1, "board_pin_id": "4" },
        { "logical_pin_name": "addr_a", "bit_index": 2, "board_pin_id": "5" },
        { "logical_pin_name": "addr_a", "bit_index": 3, "board_pin_id": "6" },
        { "logical_pin_name": "addr_b", "bit_index": 0, "board_pin_id": "7" },
        { "logical_pin_name": "addr_b", "bit_index": 1, "board_pin_id": "8" },
        { "logical_pin_name": "addr_b", "bit_index": 2, "board_pin_id": "9" },
        { "logical_pin_name": "addr_b", "bit_index": 3, "board_pin_id": "10" },
        { "logical_pin_name": "result", "bit_index": 0, "board_pin_id": "11" },
        { "logical_pin_name": "result", "bit_index": 1, "board_pin_id": "12" },
        { "logical_pin_name": "result", "bit_index": 2, "board_pin_id": "13" },
        { "logical_pin_name": "result", "bit_index": 3, "board_pin_id": "14" },
        { "logical_pin_name": "result", "bit_index": 4, "board_pin_id": "15" },
        { "logical_pin_name": "result", "bit_index": 5, "board_pin_id": "16" },
        { "logical_pin_name": "result", "bit_index": 6, "board_pin_id": "17" },
        { "logical_pin_name": "result", "bit_index": 7, "board_pin_id": "18" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 4, "top_bit_index": 0, "pin_id": 4, "pin_bit_index": 0 },
        { "top_port_signal_id": 4, "top_bit_index": 1, "pin_id": 4, "pin_bit_index": 1 },
        { "top_port_signal_id": 4, "top_bit_index": 2, "pin_id": 4, "pin_bit_index": 2 },
        { "top_port_signal_id": 4, "top_bit_index": 3, "pin_id": 4, "pin_bit_index": 3 },
        { "top_port_signal_id": 4, "top_bit_index": 4, "pin_id": 4, "pin_bit_index": 4 },
        { "top_port_signal_id": 4, "top_bit_index": 5, "pin_id": 4, "pin_bit_index": 5 },
        { "top_port_signal_id": 4, "top_bit_index": 6, "pin_id": 4, "pin_bit_index": 6 },
        { "top_port_signal_id": 4, "top_bit_index": 7, "pin_id": 4, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 102 }
    ]
  }
}
