{
  "ir_version": "0.1.0",
  "design": {
    "name": "multi_pll_test",
    "modules": [
      {
        "id": 0,
        "name": "multi_pll_top",
        "base_module_id": -1,
        "source_line": 87,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk_a",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 89,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "clk_b",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 90,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "clk_c",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 91,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "clk_d",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 92,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 93,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 5,
          "name": "leds",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 94,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 6,
          "name": "cnt_a",
          "kind": "register",
          "width": 24,
          "owner_module_id": 0,
          "source_line": 98,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 24 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 7,
          "name": "cnt_b",
          "kind": "register",
          "width": 24,
          "owner_module_id": 0,
          "source_line": 99,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 24 }, "home_clock_domain_id": 1 }
        },
        {
          "id": 8,
          "name": "cnt_c",
          "kind": "register",
          "width": 24,
          "owner_module_id": 0,
          "source_line": 100,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 24 }, "home_clock_domain_id": 2 }
        },
        {
          "id": 9,
          "name": "cnt_d",
          "kind": "register",
          "width": 24,
          "owner_module_id": 0,
          "source_line": 101,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 24 }, "home_clock_domain_id": 3 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [6],
            "reset_signal_id": 4,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 111, "condition": { "kind": "logical_not", "width": 1, "source_line": 111, "operand": { "kind": "signal_ref", "width": 1, "source_line": 111, "signal_id": 4 } }, "then": { "kind": "block", "source_line": 111, "statements": [{ "kind": "assignment", "id": 1, "source_line": 111, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "literal", "width": 24, "source_line": 111, "literal": { "value": 0, "width": 24 } } }] }, "else": { "kind": "block", "source_line": 111, "statements": [{ "kind": "assignment", "id": 0, "source_line": 112, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 24, "source_line": 112, "left": { "kind": "signal_ref", "width": 24, "source_line": 112, "signal_id": 6 }, "right": { "kind": "literal", "width": 24, "source_line": 112, "literal": { "value": 1, "width": 24 } } } }] } }
          },
          {
            "id": 1,
            "clock_signal_id": 1,
            "edge": "RISING",
            "register_ids": [7],
            "reset_signal_id": 4,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 1, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 115, "condition": { "kind": "logical_not", "width": 1, "source_line": 115, "operand": { "kind": "signal_ref", "width": 1, "source_line": 115, "signal_id": 4 } }, "then": { "kind": "block", "source_line": 115, "statements": [{ "kind": "assignment", "id": 1, "source_line": 115, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "literal", "width": 24, "source_line": 115, "literal": { "value": 0, "width": 24 } } }] }, "else": { "kind": "block", "source_line": 115, "statements": [{ "kind": "assignment", "id": 0, "source_line": 116, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 24, "source_line": 116, "left": { "kind": "signal_ref", "width": 24, "source_line": 116, "signal_id": 7 }, "right": { "kind": "literal", "width": 24, "source_line": 116, "literal": { "value": 1, "width": 24 } } } }] } }
          },
          {
            "id": 2,
            "clock_signal_id": 2,
            "edge": "RISING",
            "register_ids": [8],
            "reset_signal_id": 4,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 2, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 119, "condition": { "kind": "logical_not", "width": 1, "source_line": 119, "operand": { "kind": "signal_ref", "width": 1, "source_line": 119, "signal_id": 4 } }, "then": { "kind": "block", "source_line": 119, "statements": [{ "kind": "assignment", "id": 1, "source_line": 119, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 24, "source_line": 119, "literal": { "value": 0, "width": 24 } } }] }, "else": { "kind": "block", "source_line": 119, "statements": [{ "kind": "assignment", "id": 0, "source_line": 120, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 24, "source_line": 120, "left": { "kind": "signal_ref", "width": 24, "source_line": 120, "signal_id": 8 }, "right": { "kind": "literal", "width": 24, "source_line": 120, "literal": { "value": 1, "width": 24 } } } }] } }
          },
          {
            "id": 3,
            "clock_signal_id": 3,
            "edge": "RISING",
            "register_ids": [9],
            "reset_signal_id": 4,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 3, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 123, "condition": { "kind": "logical_not", "width": 1, "source_line": 123, "operand": { "kind": "signal_ref", "width": 1, "source_line": 123, "signal_id": 4 } }, "then": { "kind": "block", "source_line": 123, "statements": [{ "kind": "assignment", "id": 1, "source_line": 123, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 24, "source_line": 123, "literal": { "value": 0, "width": 24 } } }] }, "else": { "kind": "block", "source_line": 123, "statements": [{ "kind": "assignment", "id": 0, "source_line": 124, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 24, "source_line": 124, "left": { "kind": "signal_ref", "width": 24, "source_line": 124, "signal_id": 9 }, "right": { "kind": "literal", "width": 24, "source_line": 124, "literal": { "value": 1, "width": 24 } } } }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 104, "statements": [{ "kind": "assignment", "id": 0, "source_line": 105, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": true, "lhs_msb": 0, "lhs_lsb": 0, "rhs": { "kind": "slice", "width": 1, "source_line": 105, "signal_id": 6, "msb": 23, "lsb": 23 } }, { "kind": "assignment", "id": 1, "source_line": 106, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": true, "lhs_msb": 1, "lhs_lsb": 1, "rhs": { "kind": "slice", "width": 1, "source_line": 106, "signal_id": 7, "msb": 23, "lsb": 23 } }, { "kind": "assignment", "id": 2, "source_line": 107, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": true, "lhs_msb": 2, "lhs_lsb": 2, "rhs": { "kind": "slice", "width": 1, "source_line": 107, "signal_id": 8, "msb": 23, "lsb": 23 } }, { "kind": "assignment", "id": 3, "source_line": 108, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": true, "lhs_msb": 3, "lhs_lsb": 3, "rhs": { "kind": "slice", "width": 1, "source_line": 108, "signal_id": 9, "msb": 23, "lsb": 23 } }] }
      }
    ],
    "project": {
      "name": "multi_pll_test",
      "clocks": [
        { "name": "SCLK", "period_ns": 5, "edge": "RISING" },
        { "name": "CLK_A", "period_ns": 4, "edge": "RISING" },
        { "name": "CLK_B", "period_ns": 10, "edge": "RISING" },
        { "name": "CLK_C", "period_ns": 5.12195122, "edge": "RISING" },
        { "name": "CLK_D", "period_ns": 7.80487805, "edge": "RISING" }
      ],
      "clock_gens": [
        {
          "units": [
            {
              "type": "PLL",
              "inputs": [
                { "selector": "REF_CLK", "signal_name": "SCLK" }
              ],
              "outputs": [
                { "selector": "BASE", "clock_name": "CLK_A", "is_clock": true }
              ],
              "configs": [
                { "param_name": "DIVCLK_DIVIDE", "param_value": "1" },
                { "param_name": "CLKFBOUT_MULT", "param_value": "5" },
                { "param_name": "CLKOUT0_DIVIDE", "param_value": "4" }
              ]
            },
            {
              "type": "PLL",
              "inputs": [
                { "selector": "REF_CLK", "signal_name": "SCLK" }
              ],
              "outputs": [
                { "selector": "BASE", "clock_name": "CLK_B", "is_clock": true }
              ],
              "configs": [
                { "param_name": "DIVCLK_DIVIDE", "param_value": "1" },
                { "param_name": "CLKFBOUT_MULT", "param_value": "5" },
                { "param_name": "CLKOUT0_DIVIDE", "param_value": "10" }
              ]
            },
            {
              "type": "PLL2",
              "inputs": [
                { "selector": "REF_CLK", "signal_name": "SCLK" }
              ],
              "outputs": [
                { "selector": "BASE", "clock_name": "CLK_C", "is_clock": true },
                { "selector": "CLKOUT1", "clock_name": "CLK_D", "is_clock": true }
              ],
              "configs": [
                { "param_name": "DIVCLK_DIVIDE", "param_value": "1" },
                { "param_name": "CLKFBOUT_MULT_F", "param_value": "5.125" },
                { "param_name": "CLKOUT0_DIVIDE_F", "param_value": "5.25" },
                { "param_name": "CLKOUT1_DIVIDE", "param_value": "8" }
              ]
            }
          ]
        }
      ],
      "pins": [
        { "id": 0, "name": "SCLK", "kind": "IN", "width": 1, "standard": "LVDS25", "drive_ma": -1, "drive": -1, "mode": "DIFFERENTIAL", "term": false, "pull": "NONE" },
        { "id": 1, "name": "KEY", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "LED", "kind": "OUT", "width": 4, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "SCLK", "bit_index": -1, "board_pin_id": "R4", "board_pin_n_id": "T4" },
        { "logical_pin_name": "KEY", "bit_index": 0, "board_pin_id": "W21" },
        { "logical_pin_name": "LED", "bit_index": 0, "board_pin_id": "J21" },
        { "logical_pin_name": "LED", "bit_index": 1, "board_pin_id": "J19" },
        { "logical_pin_name": "LED", "bit_index": 2, "board_pin_id": "H19" },
        { "logical_pin_name": "LED", "bit_index": 3, "board_pin_id": "K18" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": -1, "pin_bit_index": -1, "const_value": 0 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": -1, "pin_bit_index": -1, "const_value": 0 },
        { "top_port_signal_id": 2, "top_bit_index": -1, "pin_id": -1, "pin_bit_index": -1, "const_value": 0 },
        { "top_port_signal_id": 3, "top_bit_index": -1, "pin_id": -1, "pin_bit_index": -1, "const_value": 0 },
        { "top_port_signal_id": 4, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": 0, "inverted": 1 },
        { "top_port_signal_id": 5, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 5, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 5, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 5, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 126 }
    ]
  }
}
