{
  "ir_version": "0.1.0",
  "design": {
    "name": "unwritten_reg_reset_test",
    "modules": [
      {
        "id": 0,
        "name": "unwritten_reg_test_module",
        "base_module_id": -1,
        "source_line": 45,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 47,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 48,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "d_in",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 49,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "q",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 50,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "scaled",
          "kind": "net",
          "width": 16,
          "owner_module_id": 0,
          "source_line": 54,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 5,
          "name": "data",
          "kind": "register",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 59,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 6,
          "name": "factor",
          "kind": "register",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 64,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 171, "width": 8 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [5, 6],
            "reset_signal_id": 1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 72, "condition": { "kind": "logical_not", "width": 1, "source_line": 72, "operand": { "kind": "signal_ref", "width": 1, "source_line": 72, "signal_id": 1 } }, "then": { "kind": "block", "source_line": 72, "statements": [{ "kind": "assignment", "id": 1, "source_line": 72, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 72, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 2, "source_line": 72, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 72, "literal": { "value": 171, "width": 8 } } }] }, "else": { "kind": "block", "source_line": 72, "statements": [{ "kind": "assignment", "id": 0, "source_line": 73, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 73, "signal_id": 2 } }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 67, "statements": [{ "kind": "assignment", "id": 0, "source_line": 68, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "binary_mul", "width": 16, "source_line": 68, "left": { "kind": "signal_ref", "width": 8, "source_line": 68, "signal_id": 2 }, "right": { "kind": "signal_ref", "width": 8, "source_line": 68, "signal_id": 6 } } }, { "kind": "assignment", "id": 1, "source_line": 69, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "slice", "width": 8, "source_line": 69, "signal_id": 4, "msb": 15, "lsb": 8 } }] }
      }
    ],
    "project": {
      "name": "unwritten_reg_reset_test",
      "clocks": [
        { "name": "sys_clk", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "sys_clk", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "sys_rst", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "data_in", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "result", "kind": "OUT", "width": 8, "standard": "LVCMOS18", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "sys_clk", "bit_index": -1, "board_pin_id": "52" },
        { "logical_pin_name": "sys_rst", "bit_index": -1, "board_pin_id": "53" },
        { "logical_pin_name": "data_in", "bit_index": 0, "board_pin_id": "1" },
        { "logical_pin_name": "data_in", "bit_index": 1, "board_pin_id": "2" },
        { "logical_pin_name": "data_in", "bit_index": 2, "board_pin_id": "3" },
        { "logical_pin_name": "data_in", "bit_index": 3, "board_pin_id": "4" },
        { "logical_pin_name": "data_in", "bit_index": 4, "board_pin_id": "5" },
        { "logical_pin_name": "data_in", "bit_index": 5, "board_pin_id": "6" },
        { "logical_pin_name": "data_in", "bit_index": 6, "board_pin_id": "7" },
        { "logical_pin_name": "data_in", "bit_index": 7, "board_pin_id": "8" },
        { "logical_pin_name": "result", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "result", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "result", "bit_index": 2, "board_pin_id": "12" },
        { "logical_pin_name": "result", "bit_index": 3, "board_pin_id": "13" },
        { "logical_pin_name": "result", "bit_index": 4, "board_pin_id": "14" },
        { "logical_pin_name": "result", "bit_index": 5, "board_pin_id": "15" },
        { "logical_pin_name": "result", "bit_index": 6, "board_pin_id": "16" },
        { "logical_pin_name": "result", "bit_index": 7, "board_pin_id": "17" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 2, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 2, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 2, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 75 }
    ]
  }
}
