{
  "ir_version": "0.1.0",
  "design": {
    "name": "global_integration_test",
    "modules": [
      {
        "id": 0,
        "name": "protocol_manager",
        "base_module_id": -1,
        "source_line": 78,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 80,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 81,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "por",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 82,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "rx_data",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 83,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "valid",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 84,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 5,
          "name": "reset",
          "kind": "net",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 88,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 6,
          "name": "buffer_source",
          "kind": "net",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 92,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 7,
          "name": "is_sync",
          "kind": "net",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 94,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 8,
          "name": "status_reg",
          "kind": "register",
          "width": 16,
          "owner_module_id": 0,
          "source_line": 107,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 42405, "width": 16 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 9,
          "name": "match_flag",
          "kind": "register",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 108,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 1 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 200000,
          "name": "packet_storage_port_a_addr",
          "kind": "register",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 2 }, "home_clock_domain_id": -1 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [9, 8],
            "reset_signal_id": 5,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 131, "condition": { "kind": "logical_not", "width": 1, "source_line": 131, "operand": { "kind": "signal_ref", "width": 1, "source_line": 131, "signal_id": 5 } }, "then": { "kind": "block", "source_line": 131, "statements": [{ "kind": "assignment", "id": 3, "source_line": 131, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 131, "literal": { "value": 0, "width": 1 } } }, { "kind": "assignment", "id": 4, "source_line": 131, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 16, "source_line": 131, "literal": { "value": 42405, "width": 16 } } }] }, "else": { "kind": "block", "source_line": 131, "statements": [{ "kind": "if", "source_line": 132, "condition": { "kind": "signal_ref", "width": 1, "source_line": 132, "signal_id": 7 }, "then": { "kind": "block", "source_line": 132, "statements": [{ "kind": "assignment", "id": 0, "source_line": 133, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 133, "literal": { "value": 1, "width": 1 } } }, { "kind": "assignment", "id": 1, "source_line": 136, "assignment_kind": "ASSIGN_RECEIVE_ZEXT", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 136, "literal": { "value": 1, "width": 8 } } }] }, "else": { "kind": "block", "source_line": 137, "statements": [{ "kind": "assignment", "id": 2, "source_line": 138, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 138, "literal": { "value": 0, "width": 1 } } }] } }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
          {
            "id": 0,
            "name": "packet_storage",
            "type": "BLOCK",
            "word_width": 3,
            "depth": 3,
            "address_width": 2,
            "init_literal": { "value": 0, "width": 3 },
            "ports": [
              { "name": "port_a", "kind": "READ_SYNC", "address_width": 2 },
              { "name": "port_b", "kind": "WRITE", "address_width": 2, "write_mode": "READ_FIRST" }
            ]
          }
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 119, "statements": [{ "kind": "assignment", "id": 0, "source_line": 120, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "binary_and", "width": 1, "source_line": 120, "left": { "kind": "signal_ref", "width": 1, "source_line": 120, "signal_id": 2 }, "right": { "kind": "signal_ref", "width": 1, "source_line": 120, "signal_id": 1 } } }, { "kind": "assignment", "id": 1, "source_line": 124, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "binary_eq", "width": 1, "source_line": 124, "left": { "kind": "signal_ref", "width": 3, "source_line": 124, "signal_id": 3 }, "right": { "kind": "literal", "width": 3, "source_line": 124, "literal": { "value": 5, "width": 3 } } } }, { "kind": "assignment", "id": 2, "source_line": 128, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 128, "signal_id": 9 } }] }
      }
    ],
    "project": {
      "name": "global_integration_test",
      "clocks": [
        { "name": "SCLK", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "SCLK", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "DONE", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "KEY", "kind": "IN", "width": 2, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "A", "kind": "IN", "width": 3, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "LED", "kind": "OUT", "width": 6, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "SCLK", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "KEY", "bit_index": 0, "board_pin_id": "88" },
        { "logical_pin_name": "KEY", "bit_index": 1, "board_pin_id": "87" },
        { "logical_pin_name": "A", "bit_index": 0, "board_pin_id": "73" },
        { "logical_pin_name": "A", "bit_index": 1, "board_pin_id": "74" },
        { "logical_pin_name": "A", "bit_index": 2, "board_pin_id": "75" },
        { "logical_pin_name": "LED", "bit_index": 0, "board_pin_id": "15" },
        { "logical_pin_name": "LED", "bit_index": 1, "board_pin_id": "16" },
        { "logical_pin_name": "LED", "bit_index": 2, "board_pin_id": "17" },
        { "logical_pin_name": "LED", "bit_index": 3, "board_pin_id": "18" },
        { "logical_pin_name": "LED", "bit_index": 4, "board_pin_id": "19" },
        { "logical_pin_name": "LED", "bit_index": 5, "board_pin_id": "20" },
        { "logical_pin_name": "DONE", "bit_index": -1, "board_pin_id": "IOR32B" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 2, "pin_bit_index": 0, "inverted": 1 },
        { "top_port_signal_id": 2, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 4, "top_bit_index": -1, "pin_id": 4, "pin_bit_index": 0, "inverted": 1 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 141 }
    ]
  }
}
