{
  "ir_version": "0.1.0",
  "design": {
    "name": "override_specialization_test",
    "modules": [
      {
        "id": 0,
        "name": "configurable_unit",
        "base_module_id": -1,
        "source_line": 62,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "data_in",
          "kind": "port",
          "width": 12,
          "owner_module_id": 0,
          "source_line": 69,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "data_out",
          "kind": "port",
          "width": 12,
          "owner_module_id": 0,
          "source_line": 70,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 2,
          "name": "masked",
          "kind": "net",
          "width": 12,
          "owner_module_id": 0,
          "source_line": 74,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 77, "statements": [{ "kind": "assignment", "id": 0, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 12, "source_line": 78, "signal_id": 0 } }, { "kind": "assignment", "id": 1, "source_line": 79, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 1, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 12, "source_line": 79, "signal_id": 2 } }] }
      },
      {
        "id": 1,
        "name": "override_test",
        "base_module_id": -1,
        "source_line": 88,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "d_in",
          "kind": "port",
          "width": 16,
          "owner_module_id": 1,
          "source_line": 95,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "out_a",
          "kind": "port",
          "width": 16,
          "owner_module_id": 1,
          "source_line": 96,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 2,
          "name": "out_b",
          "kind": "port",
          "width": 10,
          "owner_module_id": 1,
          "source_line": 97,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 3,
          "name": "out_c",
          "kind": "port",
          "width": 12,
          "owner_module_id": 1,
          "source_line": 98,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
          {
            "id": 0,
            "name": "inst_literal",
            "child_module_id": 2,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }]
          },
          {
            "id": 1,
            "name": "inst_const",
            "child_module_id": 3,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0, "parent_msb": 9, "parent_lsb": 0 }, { "parent_signal_id": 2, "child_port_id": 1 }]
          },
          {
            "id": 2,
            "name": "inst_config",
            "child_module_id": 4,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0, "parent_msb": 11, "parent_lsb": 0 }, { "parent_signal_id": 3, "child_port_id": 1 }]
          }
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": null
      },
      {
        "id": 2,
        "name": "configurable_unit__SPEC_DEPTH_8_WIDTH_16",
        "base_module_id": 0,
        "source_line": 62,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "data_in",
          "kind": "port",
          "width": 16,
          "owner_module_id": 2,
          "source_line": 69,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "data_out",
          "kind": "port",
          "width": 16,
          "owner_module_id": 2,
          "source_line": 70,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 2,
          "name": "masked",
          "kind": "net",
          "width": 16,
          "owner_module_id": 2,
          "source_line": 74,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 77, "statements": [{ "kind": "assignment", "id": 0, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 12, "source_line": 78, "signal_id": 0 } }, { "kind": "assignment", "id": 1, "source_line": 79, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 1, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 12, "source_line": 79, "signal_id": 2 } }] }
      },
      {
        "id": 3,
        "name": "configurable_unit__SPEC_DEPTH_5_WIDTH_10",
        "base_module_id": 0,
        "source_line": 62,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "data_in",
          "kind": "port",
          "width": 10,
          "owner_module_id": 3,
          "source_line": 69,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "data_out",
          "kind": "port",
          "width": 10,
          "owner_module_id": 3,
          "source_line": 70,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 2,
          "name": "masked",
          "kind": "net",
          "width": 10,
          "owner_module_id": 3,
          "source_line": 74,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 77, "statements": [{ "kind": "assignment", "id": 0, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 12, "source_line": 78, "signal_id": 0 } }, { "kind": "assignment", "id": 1, "source_line": 79, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 1, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 12, "source_line": 79, "signal_id": 2 } }] }
      },
      {
        "id": 4,
        "name": "configurable_unit__SPEC_DEPTH_6_WIDTH_12",
        "base_module_id": 0,
        "source_line": 62,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "data_in",
          "kind": "port",
          "width": 12,
          "owner_module_id": 4,
          "source_line": 69,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "data_out",
          "kind": "port",
          "width": 12,
          "owner_module_id": 4,
          "source_line": 70,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 2,
          "name": "masked",
          "kind": "net",
          "width": 12,
          "owner_module_id": 4,
          "source_line": 74,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 77, "statements": [{ "kind": "assignment", "id": 0, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 12, "source_line": 78, "signal_id": 0 } }, { "kind": "assignment", "id": 1, "source_line": 79, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 1, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 12, "source_line": 79, "signal_id": 2 } }] }
      }
    ],
    "project": {
      "name": "override_specialization_test",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "d_in", "kind": "IN", "width": 16, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "out_a", "kind": "OUT", "width": 16, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "out_b", "kind": "OUT", "width": 10, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "out_c", "kind": "OUT", "width": 12, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "d_in", "bit_index": 0, "board_pin_id": "2" },
        { "logical_pin_name": "d_in", "bit_index": 1, "board_pin_id": "3" },
        { "logical_pin_name": "d_in", "bit_index": 2, "board_pin_id": "4" },
        { "logical_pin_name": "d_in", "bit_index": 3, "board_pin_id": "5" },
        { "logical_pin_name": "d_in", "bit_index": 4, "board_pin_id": "6" },
        { "logical_pin_name": "d_in", "bit_index": 5, "board_pin_id": "7" },
        { "logical_pin_name": "d_in", "bit_index": 6, "board_pin_id": "8" },
        { "logical_pin_name": "d_in", "bit_index": 7, "board_pin_id": "9" },
        { "logical_pin_name": "d_in", "bit_index": 8, "board_pin_id": "10" },
        { "logical_pin_name": "d_in", "bit_index": 9, "board_pin_id": "11" },
        { "logical_pin_name": "d_in", "bit_index": 10, "board_pin_id": "12" },
        { "logical_pin_name": "d_in", "bit_index": 11, "board_pin_id": "13" },
        { "logical_pin_name": "d_in", "bit_index": 12, "board_pin_id": "14" },
        { "logical_pin_name": "d_in", "bit_index": 13, "board_pin_id": "15" },
        { "logical_pin_name": "d_in", "bit_index": 14, "board_pin_id": "16" },
        { "logical_pin_name": "d_in", "bit_index": 15, "board_pin_id": "17" },
        { "logical_pin_name": "out_a", "bit_index": 0, "board_pin_id": "20" },
        { "logical_pin_name": "out_a", "bit_index": 1, "board_pin_id": "21" },
        { "logical_pin_name": "out_a", "bit_index": 2, "board_pin_id": "22" },
        { "logical_pin_name": "out_a", "bit_index": 3, "board_pin_id": "23" },
        { "logical_pin_name": "out_a", "bit_index": 4, "board_pin_id": "24" },
        { "logical_pin_name": "out_a", "bit_index": 5, "board_pin_id": "25" },
        { "logical_pin_name": "out_a", "bit_index": 6, "board_pin_id": "26" },
        { "logical_pin_name": "out_a", "bit_index": 7, "board_pin_id": "27" },
        { "logical_pin_name": "out_a", "bit_index": 8, "board_pin_id": "28" },
        { "logical_pin_name": "out_a", "bit_index": 9, "board_pin_id": "29" },
        { "logical_pin_name": "out_a", "bit_index": 10, "board_pin_id": "30" },
        { "logical_pin_name": "out_a", "bit_index": 11, "board_pin_id": "31" },
        { "logical_pin_name": "out_a", "bit_index": 12, "board_pin_id": "32" },
        { "logical_pin_name": "out_a", "bit_index": 13, "board_pin_id": "33" },
        { "logical_pin_name": "out_a", "bit_index": 14, "board_pin_id": "34" },
        { "logical_pin_name": "out_a", "bit_index": 15, "board_pin_id": "35" },
        { "logical_pin_name": "out_b", "bit_index": 0, "board_pin_id": "40" },
        { "logical_pin_name": "out_b", "bit_index": 1, "board_pin_id": "41" },
        { "logical_pin_name": "out_b", "bit_index": 2, "board_pin_id": "42" },
        { "logical_pin_name": "out_b", "bit_index": 3, "board_pin_id": "43" },
        { "logical_pin_name": "out_b", "bit_index": 4, "board_pin_id": "44" },
        { "logical_pin_name": "out_b", "bit_index": 5, "board_pin_id": "45" },
        { "logical_pin_name": "out_b", "bit_index": 6, "board_pin_id": "46" },
        { "logical_pin_name": "out_b", "bit_index": 7, "board_pin_id": "47" },
        { "logical_pin_name": "out_b", "bit_index": 8, "board_pin_id": "48" },
        { "logical_pin_name": "out_b", "bit_index": 9, "board_pin_id": "49" },
        { "logical_pin_name": "out_c", "bit_index": 0, "board_pin_id": "60" },
        { "logical_pin_name": "out_c", "bit_index": 1, "board_pin_id": "61" },
        { "logical_pin_name": "out_c", "bit_index": 2, "board_pin_id": "62" },
        { "logical_pin_name": "out_c", "bit_index": 3, "board_pin_id": "63" },
        { "logical_pin_name": "out_c", "bit_index": 4, "board_pin_id": "64" },
        { "logical_pin_name": "out_c", "bit_index": 5, "board_pin_id": "65" },
        { "logical_pin_name": "out_c", "bit_index": 6, "board_pin_id": "66" },
        { "logical_pin_name": "out_c", "bit_index": 7, "board_pin_id": "67" },
        { "logical_pin_name": "out_c", "bit_index": 8, "board_pin_id": "68" },
        { "logical_pin_name": "out_c", "bit_index": 9, "board_pin_id": "69" },
        { "logical_pin_name": "out_c", "bit_index": 10, "board_pin_id": "70" },
        { "logical_pin_name": "out_c", "bit_index": 11, "board_pin_id": "71" }
      ],
      "top_module_id": 1,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": 0, "pin_id": 0, "pin_bit_index": 0 },
        { "top_port_signal_id": 0, "top_bit_index": 1, "pin_id": 0, "pin_bit_index": 1 },
        { "top_port_signal_id": 0, "top_bit_index": 2, "pin_id": 0, "pin_bit_index": 2 },
        { "top_port_signal_id": 0, "top_bit_index": 3, "pin_id": 0, "pin_bit_index": 3 },
        { "top_port_signal_id": 0, "top_bit_index": 4, "pin_id": 0, "pin_bit_index": 4 },
        { "top_port_signal_id": 0, "top_bit_index": 5, "pin_id": 0, "pin_bit_index": 5 },
        { "top_port_signal_id": 0, "top_bit_index": 6, "pin_id": 0, "pin_bit_index": 6 },
        { "top_port_signal_id": 0, "top_bit_index": 7, "pin_id": 0, "pin_bit_index": 7 },
        { "top_port_signal_id": 0, "top_bit_index": 8, "pin_id": 0, "pin_bit_index": 8 },
        { "top_port_signal_id": 0, "top_bit_index": 9, "pin_id": 0, "pin_bit_index": 9 },
        { "top_port_signal_id": 0, "top_bit_index": 10, "pin_id": 0, "pin_bit_index": 10 },
        { "top_port_signal_id": 0, "top_bit_index": 11, "pin_id": 0, "pin_bit_index": 11 },
        { "top_port_signal_id": 0, "top_bit_index": 12, "pin_id": 0, "pin_bit_index": 12 },
        { "top_port_signal_id": 0, "top_bit_index": 13, "pin_id": 0, "pin_bit_index": 13 },
        { "top_port_signal_id": 0, "top_bit_index": 14, "pin_id": 0, "pin_bit_index": 14 },
        { "top_port_signal_id": 0, "top_bit_index": 15, "pin_id": 0, "pin_bit_index": 15 },
        { "top_port_signal_id": 1, "top_bit_index": 0, "pin_id": 1, "pin_bit_index": 0 },
        { "top_port_signal_id": 1, "top_bit_index": 1, "pin_id": 1, "pin_bit_index": 1 },
        { "top_port_signal_id": 1, "top_bit_index": 2, "pin_id": 1, "pin_bit_index": 2 },
        { "top_port_signal_id": 1, "top_bit_index": 3, "pin_id": 1, "pin_bit_index": 3 },
        { "top_port_signal_id": 1, "top_bit_index": 4, "pin_id": 1, "pin_bit_index": 4 },
        { "top_port_signal_id": 1, "top_bit_index": 5, "pin_id": 1, "pin_bit_index": 5 },
        { "top_port_signal_id": 1, "top_bit_index": 6, "pin_id": 1, "pin_bit_index": 6 },
        { "top_port_signal_id": 1, "top_bit_index": 7, "pin_id": 1, "pin_bit_index": 7 },
        { "top_port_signal_id": 1, "top_bit_index": 8, "pin_id": 1, "pin_bit_index": 8 },
        { "top_port_signal_id": 1, "top_bit_index": 9, "pin_id": 1, "pin_bit_index": 9 },
        { "top_port_signal_id": 1, "top_bit_index": 10, "pin_id": 1, "pin_bit_index": 10 },
        { "top_port_signal_id": 1, "top_bit_index": 11, "pin_id": 1, "pin_bit_index": 11 },
        { "top_port_signal_id": 1, "top_bit_index": 12, "pin_id": 1, "pin_bit_index": 12 },
        { "top_port_signal_id": 1, "top_bit_index": 13, "pin_id": 1, "pin_bit_index": 13 },
        { "top_port_signal_id": 1, "top_bit_index": 14, "pin_id": 1, "pin_bit_index": 14 },
        { "top_port_signal_id": 1, "top_bit_index": 15, "pin_id": 1, "pin_bit_index": 15 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 2, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 2, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 2, "pin_bit_index": 7 },
        { "top_port_signal_id": 2, "top_bit_index": 8, "pin_id": 2, "pin_bit_index": 8 },
        { "top_port_signal_id": 2, "top_bit_index": 9, "pin_id": 2, "pin_bit_index": 9 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 8, "pin_id": 3, "pin_bit_index": 8 },
        { "top_port_signal_id": 3, "top_bit_index": 9, "pin_id": 3, "pin_bit_index": 9 },
        { "top_port_signal_id": 3, "top_bit_index": 10, "pin_id": 3, "pin_bit_index": 10 },
        { "top_port_signal_id": 3, "top_bit_index": 11, "pin_id": 3, "pin_bit_index": 11 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 133 }
    ]
  }
}
