{
  "ir_version": "0.1.0",
  "design": {
    "name": "CDC_BUS_PROJECT",
    "modules": [
      {
        "id": 0,
        "name": "cdc_bus_test",
        "base_module_id": -1,
        "source_line": 9,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk_a",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 11,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "clk_b",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 12,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "q",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 13,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 3,
          "name": "counter",
          "kind": "register",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 16,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 4,
          "name": "dest_reg",
          "kind": "register",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 17,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 1 }, "home_clock_domain_id": 1 }
        },
        {
          "id": 5,
          "name": "counter_sync",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 20,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [3],
            "reset_signal_id": -1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "block", "source_line": 25, "statements": [{ "kind": "assignment", "id": 0, "source_line": 26, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 8, "source_line": 26, "left": { "kind": "signal_ref", "width": 8, "source_line": 26, "signal_id": 3 }, "right": { "kind": "literal", "width": 8, "source_line": 26, "literal": { "value": 1, "width": 8 } } } }] }
          },
          {
            "id": 1,
            "clock_signal_id": 1,
            "edge": "RISING",
            "register_ids": [4],
            "reset_signal_id": -1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 1, "edge": "RISING" }],
            "statements": { "kind": "block", "source_line": 28, "statements": [{ "kind": "assignment", "id": 0, "source_line": 29, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 29, "signal_id": 5, "msb": 0, "lsb": 0 } }] }
          }
        ],
        "instances": [
          {
            "id": 0,
            "name": "u_cdc_bus_counter_sync",
            "child_module_id": 1,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": 3, "child_port_id": 2 }, { "parent_signal_id": 5, "child_port_id": 3 }]
          }
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 22, "statements": [{ "kind": "assignment", "id": 0, "source_line": 23, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 0, "source_line": 23, "signal_id": 5 } }] }
      },
      {
        "id": 1,
        "name": "JZHDL_LIB_CDC_BUS__W8",
        "base_module_id": -1,
        "source_line": 0,
        "source_file": "",
      "signals": [
        {
          "id": 0,
          "name": "clk_src",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "clk_dest",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "data_in",
          "kind": "port",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "data_out",
          "kind": "port",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "gray_src",
          "kind": "register",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 5,
          "name": "gray_sync1",
          "kind": "register",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 1 }
        },
        {
          "id": 6,
          "name": "gray_sync2",
          "kind": "register",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 1 }
        },
        {
          "id": 7,
          "name": "bin_dest",
          "kind": "net",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 0,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [4],
            "reset_signal_id": -1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_HIGH",
            "reset_type": "IMMEDIATE",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "block", "statements": [{ "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "binary_xor", "width": 8, "left": { "kind": "binary_shr", "width": 8, "left": { "kind": "signal_ref", "width": 8, "signal_id": 2 }, "right": { "kind": "literal", "width": 8, "literal": { "value": 1, "width": 8 } } }, "right": { "kind": "signal_ref", "width": 8, "signal_id": 2 } } }] }
          },
          {
            "id": 1,
            "clock_signal_id": 1,
            "edge": "RISING",
            "register_ids": [5, 6],
            "reset_signal_id": -1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_HIGH",
            "reset_type": "IMMEDIATE",
            "sensitivity_list": [{ "signal_id": 1, "edge": "RISING" }],
            "statements": { "kind": "block", "statements": [{ "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "signal_id": 4 } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "signal_id": 5 } }] }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "statements": [{ "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 7, "is_sliced": true, "lhs_msb": 7, "lhs_lsb": 7, "rhs": { "kind": "slice", "width": 1, "signal_id": 6, "msb": 7, "lsb": 7 } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 7, "is_sliced": true, "lhs_msb": 6, "lhs_lsb": 6, "rhs": { "kind": "binary_xor", "width": 1, "left": { "kind": "slice", "width": 1, "signal_id": 7, "msb": 7, "lsb": 7 }, "right": { "kind": "slice", "width": 1, "signal_id": 6, "msb": 6, "lsb": 6 } } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 7, "is_sliced": true, "lhs_msb": 5, "lhs_lsb": 5, "rhs": { "kind": "binary_xor", "width": 1, "left": { "kind": "slice", "width": 1, "signal_id": 7, "msb": 6, "lsb": 6 }, "right": { "kind": "slice", "width": 1, "signal_id": 6, "msb": 5, "lsb": 5 } } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 7, "is_sliced": true, "lhs_msb": 4, "lhs_lsb": 4, "rhs": { "kind": "binary_xor", "width": 1, "left": { "kind": "slice", "width": 1, "signal_id": 7, "msb": 5, "lsb": 5 }, "right": { "kind": "slice", "width": 1, "signal_id": 6, "msb": 4, "lsb": 4 } } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 7, "is_sliced": true, "lhs_msb": 3, "lhs_lsb": 3, "rhs": { "kind": "binary_xor", "width": 1, "left": { "kind": "slice", "width": 1, "signal_id": 7, "msb": 4, "lsb": 4 }, "right": { "kind": "slice", "width": 1, "signal_id": 6, "msb": 3, "lsb": 3 } } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 7, "is_sliced": true, "lhs_msb": 2, "lhs_lsb": 2, "rhs": { "kind": "binary_xor", "width": 1, "left": { "kind": "slice", "width": 1, "signal_id": 7, "msb": 3, "lsb": 3 }, "right": { "kind": "slice", "width": 1, "signal_id": 6, "msb": 2, "lsb": 2 } } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 7, "is_sliced": true, "lhs_msb": 1, "lhs_lsb": 1, "rhs": { "kind": "binary_xor", "width": 1, "left": { "kind": "slice", "width": 1, "signal_id": 7, "msb": 2, "lsb": 2 }, "right": { "kind": "slice", "width": 1, "signal_id": 6, "msb": 1, "lsb": 1 } } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_DRIVE", "lhs_signal_id": 7, "is_sliced": true, "lhs_msb": 0, "lhs_lsb": 0, "rhs": { "kind": "binary_xor", "width": 1, "left": { "kind": "slice", "width": 1, "signal_id": 7, "msb": 1, "lsb": 1 }, "right": { "kind": "slice", "width": 1, "signal_id": 6, "msb": 0, "lsb": 0 } } }, { "kind": "assignment", "id": 0, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "signal_id": 7 } }] }
      }
    ],
    "project": {
      "name": "CDC_BUS_PROJECT",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
      ],
      "mappings": [
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": -1, "pin_bit_index": -1, "const_value": 0 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": -1, "pin_bit_index": -1, "const_value": 0 },
        { "top_port_signal_id": 2, "top_bit_index": -1, "pin_id": -1, "pin_bit_index": -1, "const_value": 0 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 31 }
    ]
  }
}
