{
  "ir_version": "0.1.0",
  "design": {
    "name": "MathVerify",
    "modules": [
      {
        "id": 0,
        "name": "ArithmeticCore",
        "base_module_id": -1,
        "source_line": 69,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 71,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 72,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "por",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 73,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "btn",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 74,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "val_a",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 75,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 5,
          "name": "val_b",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 76,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 6,
          "name": "display",
          "kind": "port",
          "width": 6,
          "owner_module_id": 0,
          "source_line": 77,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 7,
          "name": "reset",
          "kind": "net",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 81,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 8,
          "name": "func",
          "kind": "register",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 85,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 3 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 9,
          "name": "func_done",
          "kind": "register",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 86,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 1 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 10,
          "name": "sum",
          "kind": "register",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 88,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 3 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 11,
          "name": "carry",
          "kind": "register",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 89,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 1 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 12,
          "name": "data",
          "kind": "register",
          "width": 6,
          "owner_module_id": 0,
          "source_line": 91,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 6 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 13,
          "name": "blink",
          "kind": "register",
          "width": 25,
          "owner_module_id": 0,
          "source_line": 92,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 25 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [8, 9, 13, 12, 11, 10],
            "reset_signal_id": 7,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 100, "condition": { "kind": "logical_not", "width": 1, "source_line": 100, "operand": { "kind": "signal_ref", "width": 1, "source_line": 100, "signal_id": 7 } }, "then": { "kind": "block", "source_line": 100, "statements": [{ "kind": "assignment", "id": 15, "source_line": 100, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 3, "source_line": 100, "literal": { "value": 0, "width": 3 } } }, { "kind": "assignment", "id": 16, "source_line": 100, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 100, "literal": { "value": 0, "width": 1 } } }, { "kind": "assignment", "id": 17, "source_line": 100, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 25, "source_line": 100, "literal": { "value": 0, "width": 25 } } }, { "kind": "assignment", "id": 18, "source_line": 100, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 6, "source_line": 100, "literal": { "value": 0, "width": 6 } } }, { "kind": "assignment", "id": 19, "source_line": 100, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 100, "literal": { "value": 0, "width": 1 } } }, { "kind": "assignment", "id": 20, "source_line": 100, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 3, "source_line": 100, "literal": { "value": 0, "width": 3 } } }] }, "else": { "kind": "block", "source_line": 100, "statements": [{ "kind": "if", "source_line": 102, "condition": { "kind": "logical_and", "width": 1, "source_line": 102, "left": { "kind": "binary_eq", "width": 1, "source_line": 102, "left": { "kind": "signal_ref", "width": 1, "source_line": 102, "signal_id": 3 }, "right": { "kind": "literal", "width": 1, "source_line": 102, "literal": { "value": 1, "width": 1 } } }, "right": { "kind": "binary_eq", "width": 1, "source_line": 102, "left": { "kind": "signal_ref", "width": 1, "source_line": 102, "signal_id": 9 }, "right": { "kind": "literal", "width": 1, "source_line": 102, "literal": { "value": 0, "width": 1 } } } }, "then": { "kind": "block", "source_line": 102, "statements": [{ "kind": "assignment", "id": 0, "source_line": 103, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 3, "source_line": 103, "left": { "kind": "signal_ref", "width": 3, "source_line": 103, "signal_id": 8 }, "right": { "kind": "literal", "width": 3, "source_line": 103, "literal": { "value": 1, "width": 3 } } } }, { "kind": "assignment", "id": 1, "source_line": 104, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 104, "literal": { "value": 1, "width": 1 } } }] }, "elif_chain": [{ "kind": "if", "source_line": 105, "condition": { "kind": "binary_eq", "width": 1, "source_line": 105, "left": { "kind": "signal_ref", "width": 1, "source_line": 105, "signal_id": 3 }, "right": { "kind": "literal", "width": 1, "source_line": 105, "literal": { "value": 0, "width": 1 } } }, "then": { "kind": "block", "source_line": 105, "statements": [{ "kind": "assignment", "id": 2, "source_line": 106, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 106, "literal": { "value": 0, "width": 1 } } }] } }] }, { "kind": "assignment", "id": 3, "source_line": 109, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 25, "source_line": 109, "left": { "kind": "signal_ref", "width": 25, "source_line": 109, "signal_id": 13 }, "right": { "kind": "literal", "width": 25, "source_line": 109, "literal": { "value": 1, "width": 25 } } } }, { "kind": "select", "source_line": 111, "selector": { "kind": "signal_ref", "width": 3, "source_line": 111, "signal_id": 8 }, "cases": [{ "case_value": { "kind": "literal", "width": 3, "source_line": 112, "literal": { "value": 0, "width": 3 } }, "body": { "kind": "block", "source_line": 112, "statements": [{ "kind": "assignment", "id": 4, "source_line": 114, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": true, "lhs_msb": 5, "lhs_lsb": 3, "rhs": { "kind": "ternary", "width": 0, "source_line": 114, "condition": { "kind": "slice", "width": 1, "source_line": 114, "signal_id": 13, "msb": 24, "lsb": 24 }, "true": { "kind": "literal", "width": 3, "source_line": 114, "literal": { "value": 18446744073709551615, "width": 3 } }, "false": { "kind": "literal", "width": 3, "source_line": 114, "literal": { "value": 0, "width": 3 } } } }, { "kind": "assignment", "id": 5, "source_line": 115, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": true, "lhs_msb": 2, "lhs_lsb": 0, "rhs": { "kind": "ternary", "width": 0, "source_line": 115, "condition": { "kind": "slice", "width": 1, "source_line": 115, "signal_id": 13, "msb": 24, "lsb": 24 }, "true": { "kind": "literal", "width": 3, "source_line": 115, "literal": { "value": 0, "width": 3 } }, "false": { "kind": "literal", "width": 3, "source_line": 115, "literal": { "value": 18446744073709551615, "width": 3 } } } }] } }, { "case_value": { "kind": "literal", "width": 3, "source_line": 117, "literal": { "value": 1, "width": 3 } }, "body": { "kind": "block", "source_line": 117, "statements": [{ "kind": "block", "source_line": 120, "statements": [{ "kind": "assignment", "id": 6, "source_line": 120, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "binary_and", "width": 1, "source_line": 120, "left": { "kind": "binary_shr", "width": 4, "source_line": 120, "left": { "kind": "intrinsic_uadd", "width": 4, "source_line": 120, "left": { "kind": "signal_ref", "width": 3, "source_line": 120, "signal_id": 4 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 120, "signal_id": 5 } }, "right": { "kind": "literal", "width": 32, "source_line": 120, "literal": { "value": 3, "width": 32 } } }, "right": { "kind": "literal", "width": 1, "source_line": 120, "literal": { "value": 1, "width": 1 } } } }, { "kind": "assignment", "id": 7, "source_line": 120, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "binary_and", "width": 3, "source_line": 120, "left": { "kind": "intrinsic_uadd", "width": 4, "source_line": 120, "left": { "kind": "signal_ref", "width": 3, "source_line": 120, "signal_id": 4 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 120, "signal_id": 5 } }, "right": { "kind": "literal", "width": 3, "source_line": 120, "literal": { "value": 7, "width": 3 } } } }] }, { "kind": "assignment", "id": 8, "source_line": 121, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "concat", "width": 6, "source_line": 121, "operands": [{ "kind": "signal_ref", "width": 1, "source_line": 121, "signal_id": 11 }, { "kind": "literal", "width": 2, "source_line": 121, "literal": { "value": 0, "width": 2 } }, { "kind": "signal_ref", "width": 3, "source_line": 121, "signal_id": 10 }] } }] } }, { "case_value": { "kind": "literal", "width": 3, "source_line": 123, "literal": { "value": 2, "width": 3 } }, "body": { "kind": "block", "source_line": 123, "statements": [{ "kind": "block", "source_line": 126, "statements": [{ "kind": "assignment", "id": 9, "source_line": 126, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "binary_and", "width": 1, "source_line": 126, "left": { "kind": "binary_shr", "width": 4, "source_line": 126, "left": { "kind": "intrinsic_sadd", "width": 4, "source_line": 126, "left": { "kind": "signal_ref", "width": 3, "source_line": 126, "signal_id": 4 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 126, "signal_id": 5 } }, "right": { "kind": "literal", "width": 32, "source_line": 126, "literal": { "value": 3, "width": 32 } } }, "right": { "kind": "literal", "width": 1, "source_line": 126, "literal": { "value": 1, "width": 1 } } } }, { "kind": "assignment", "id": 10, "source_line": 126, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "binary_and", "width": 3, "source_line": 126, "left": { "kind": "intrinsic_sadd", "width": 4, "source_line": 126, "left": { "kind": "signal_ref", "width": 3, "source_line": 126, "signal_id": 4 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 126, "signal_id": 5 } }, "right": { "kind": "literal", "width": 3, "source_line": 126, "literal": { "value": 7, "width": 3 } } } }] }, { "kind": "assignment", "id": 11, "source_line": 127, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "concat", "width": 6, "source_line": 127, "operands": [{ "kind": "signal_ref", "width": 1, "source_line": 127, "signal_id": 11 }, { "kind": "literal", "width": 2, "source_line": 127, "literal": { "value": 0, "width": 2 } }, { "kind": "signal_ref", "width": 3, "source_line": 127, "signal_id": 10 }] } }] } }, { "case_value": { "kind": "literal", "width": 3, "source_line": 129, "literal": { "value": 3, "width": 3 } }, "body": { "kind": "block", "source_line": 129, "statements": [{ "kind": "assignment", "id": 12, "source_line": 131, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "intrinsic_umul", "width": 6, "source_line": 131, "left": { "kind": "signal_ref", "width": 3, "source_line": 131, "signal_id": 4 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 131, "signal_id": 5 } } }] } }, { "case_value": { "kind": "literal", "width": 3, "source_line": 133, "literal": { "value": 4, "width": 3 } }, "body": { "kind": "block", "source_line": 133, "statements": [{ "kind": "assignment", "id": 13, "source_line": 135, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "intrinsic_smul", "width": 6, "source_line": 135, "left": { "kind": "signal_ref", "width": 3, "source_line": 135, "signal_id": 4 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 135, "signal_id": 5 } } }] } }, { "case_value": null, "body": { "kind": "block", "source_line": 137, "statements": [{ "kind": "assignment", "id": 14, "source_line": 138, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 6, "source_line": 138, "literal": { "value": 0, "width": 6 } } }] } }] }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 95, "statements": [{ "kind": "assignment", "id": 0, "source_line": 96, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 6, "source_line": 96, "signal_id": 12 } }, { "kind": "assignment", "id": 1, "source_line": 97, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "binary_and", "width": 1, "source_line": 97, "left": { "kind": "signal_ref", "width": 1, "source_line": 97, "signal_id": 2 }, "right": { "kind": "signal_ref", "width": 1, "source_line": 97, "signal_id": 1 } } }] }
      }
    ],
    "project": {
      "name": "MathVerify",
      "clocks": [
        { "name": "SCLK", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "SCLK", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "DONE", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "A", "kind": "IN", "width": 3, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "B", "kind": "IN", "width": 3, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "KEY", "kind": "IN", "width": 2, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 5, "name": "LED", "kind": "OUT", "width": 6, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "SCLK", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "KEY", "bit_index": 0, "board_pin_id": "88" },
        { "logical_pin_name": "KEY", "bit_index": 1, "board_pin_id": "87" },
        { "logical_pin_name": "A", "bit_index": 0, "board_pin_id": "73" },
        { "logical_pin_name": "A", "bit_index": 1, "board_pin_id": "74" },
        { "logical_pin_name": "A", "bit_index": 2, "board_pin_id": "75" },
        { "logical_pin_name": "B", "bit_index": 0, "board_pin_id": "71" },
        { "logical_pin_name": "B", "bit_index": 1, "board_pin_id": "53" },
        { "logical_pin_name": "B", "bit_index": 2, "board_pin_id": "52" },
        { "logical_pin_name": "LED", "bit_index": 0, "board_pin_id": "15" },
        { "logical_pin_name": "LED", "bit_index": 1, "board_pin_id": "16" },
        { "logical_pin_name": "LED", "bit_index": 2, "board_pin_id": "17" },
        { "logical_pin_name": "LED", "bit_index": 3, "board_pin_id": "18" },
        { "logical_pin_name": "LED", "bit_index": 4, "board_pin_id": "19" },
        { "logical_pin_name": "LED", "bit_index": 5, "board_pin_id": "20" },
        { "logical_pin_name": "DONE", "bit_index": -1, "board_pin_id": "IOR32B" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 4, "pin_bit_index": 0, "inverted": 1 },
        { "top_port_signal_id": 2, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 3, "top_bit_index": -1, "pin_id": 4, "pin_bit_index": 1 },
        { "top_port_signal_id": 4, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 4, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 4, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 5, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 5, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 5, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 6, "top_bit_index": 0, "pin_id": 5, "pin_bit_index": 0 },
        { "top_port_signal_id": 6, "top_bit_index": 1, "pin_id": 5, "pin_bit_index": 1 },
        { "top_port_signal_id": 6, "top_bit_index": 2, "pin_id": 5, "pin_bit_index": 2 },
        { "top_port_signal_id": 6, "top_bit_index": 3, "pin_id": 5, "pin_bit_index": 3 },
        { "top_port_signal_id": 6, "top_bit_index": 4, "pin_id": 5, "pin_bit_index": 4 },
        { "top_port_signal_id": 6, "top_bit_index": 5, "pin_id": 5, "pin_bit_index": 5 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 142 }
    ]
  }
}
