{
  "ir_version": "0.1.0",
  "design": {
    "name": "port_concat_binding_test",
    "modules": [
      {
        "id": 0,
        "name": "concat_child",
        "base_module_id": -1,
        "source_line": 46,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 48,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 49,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "cfg",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 52,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "sel",
          "kind": "port",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 55,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "mix",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 58,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 5,
          "name": "result",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 60,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 6,
          "name": "combined",
          "kind": "net",
          "width": 9,
          "owner_module_id": 0,
          "source_line": 64,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 7,
          "name": "out_reg",
          "kind": "register",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 68,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [7],
            "reset_signal_id": 1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 76, "condition": { "kind": "logical_not", "width": 1, "source_line": 76, "operand": { "kind": "signal_ref", "width": 1, "source_line": 76, "signal_id": 1 } }, "then": { "kind": "block", "source_line": 76, "statements": [{ "kind": "assignment", "id": 1, "source_line": 76, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 76, "literal": { "value": 0, "width": 8 } } }] }, "else": { "kind": "block", "source_line": 76, "statements": [{ "kind": "assignment", "id": 0, "source_line": 77, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "slice", "width": 8, "source_line": 77, "signal_id": 6, "msb": 7, "lsb": 0 } }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 71, "statements": [{ "kind": "assignment", "id": 0, "source_line": 72, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "concat", "width": 9, "source_line": 72, "operands": [{ "kind": "signal_ref", "width": 2, "source_line": 72, "signal_id": 3 }, { "kind": "signal_ref", "width": 4, "source_line": 72, "signal_id": 2 }, { "kind": "signal_ref", "width": 3, "source_line": 72, "signal_id": 4 }] } }, { "kind": "assignment", "id": 1, "source_line": 73, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 73, "signal_id": 7 } }] }
      },
      {
        "id": 1,
        "name": "concat_parent",
        "base_module_id": -1,
        "source_line": 81,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 83,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 84,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "en",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 85,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "out",
          "kind": "port",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 86,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "sel_a",
          "kind": "net",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 90,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 5,
          "name": "sel_b",
          "kind": "net",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 91,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 6,
          "name": "mode",
          "kind": "net",
          "width": 2,
          "owner_module_id": 1,
          "source_line": 92,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 7,
          "name": "child_result",
          "kind": "net",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 93,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 8,
          "name": "toggle",
          "kind": "register",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 97,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 1 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [8],
            "reset_signal_id": 1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 107, "condition": { "kind": "logical_not", "width": 1, "source_line": 107, "operand": { "kind": "signal_ref", "width": 1, "source_line": 107, "signal_id": 1 } }, "then": { "kind": "block", "source_line": 107, "statements": [{ "kind": "assignment", "id": 1, "source_line": 107, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 107, "literal": { "value": 0, "width": 1 } } }] }, "else": { "kind": "block", "source_line": 107, "statements": [{ "kind": "assignment", "id": 0, "source_line": 108, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "unary_not", "width": 1, "source_line": 108, "operand": { "kind": "signal_ref", "width": 1, "source_line": 108, "signal_id": 8 } } }] } }
          }
        ],
        "instances": [
          {
            "id": 0,
            "name": "u0",
            "child_module_id": 0,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": -1, "child_port_id": 2, "const_expr": "{2'b10, 2'b01}" }, { "parent_signal_id": -1, "child_port_id": 3, "const_expr": "{sel_a, sel_b}" }, { "parent_signal_id": -1, "child_port_id": 4, "const_expr": "{mode, 1'b0}" }, { "parent_signal_id": 7, "child_port_id": 5 }]
          }
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 100, "statements": [{ "kind": "assignment", "id": 0, "source_line": 101, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 101, "signal_id": 2 } }, { "kind": "assignment", "id": 1, "source_line": 102, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "unary_not", "width": 1, "source_line": 102, "operand": { "kind": "signal_ref", "width": 1, "source_line": 102, "signal_id": 2 } } }, { "kind": "assignment", "id": 2, "source_line": 103, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "concat", "width": 2, "source_line": 103, "operands": [{ "kind": "signal_ref", "width": 1, "source_line": 103, "signal_id": 2 }, { "kind": "signal_ref", "width": 1, "source_line": 103, "signal_id": 8 }] } }, { "kind": "assignment", "id": 3, "source_line": 104, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 104, "signal_id": 7 } }] }
      }
    ],
    "project": {
      "name": "port_concat_binding_test",
      "clocks": [
        { "name": "sys_clk", "period_ns": 37.037, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "sys_clk", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "sys_rst", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "enable", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "result", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "sys_clk", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "sys_rst", "bit_index": -1, "board_pin_id": "88" },
        { "logical_pin_name": "enable", "bit_index": -1, "board_pin_id": "87" },
        { "logical_pin_name": "result", "bit_index": 0, "board_pin_id": "15" },
        { "logical_pin_name": "result", "bit_index": 1, "board_pin_id": "16" },
        { "logical_pin_name": "result", "bit_index": 2, "board_pin_id": "17" },
        { "logical_pin_name": "result", "bit_index": 3, "board_pin_id": "18" },
        { "logical_pin_name": "result", "bit_index": 4, "board_pin_id": "19" },
        { "logical_pin_name": "result", "bit_index": 5, "board_pin_id": "20" },
        { "logical_pin_name": "result", "bit_index": 6, "board_pin_id": "25" },
        { "logical_pin_name": "result", "bit_index": 7, "board_pin_id": "26" }
      ],
      "top_module_id": 1,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": -1, "pin_id": 2, "pin_bit_index": -1 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 126 }
    ]
  }
}
