{
  "ir_version": "0.1.0",
  "design": {
    "name": "semi_dual_port_bsram_project",
    "modules": [
      {
        "id": 0,
        "name": "bus_driver",
        "base_module_id": -1,
        "source_line": 105,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "sel",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 107,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "addr",
          "kind": "port",
          "width": 13,
          "owner_module_id": 0,
          "source_line": 108,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "cmd",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 109,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "valid",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 110,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "din",
          "kind": "port",
          "width": 16,
          "owner_module_id": 0,
          "source_line": 111,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 5,
          "name": "dout",
          "kind": "port",
          "width": 16,
          "owner_module_id": 0,
          "source_line": 112,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 6,
          "name": "done_out",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 113,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100000,
          "name": "pbus_SEL",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 84,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100001,
          "name": "pbus_ADDR",
          "kind": "port",
          "width": 13,
          "owner_module_id": 0,
          "source_line": 85,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100002,
          "name": "pbus_CMD",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 86,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100003,
          "name": "pbus_VALID",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 87,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100004,
          "name": "pbus_DATA",
          "kind": "port",
          "width": 16,
          "owner_module_id": 0,
          "source_line": 88,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "INOUT" }
        },
        {
          "id": 100005,
          "name": "pbus_DONE",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 89,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "IN" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 117, "statements": [{ "kind": "assignment", "id": 0, "source_line": 118, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100000, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 3, "source_line": 118, "signal_id": 0 } }, { "kind": "assignment", "id": 1, "source_line": 119, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100001, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 13, "source_line": 119, "signal_id": 1 } }, { "kind": "assignment", "id": 2, "source_line": 120, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100002, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 120, "signal_id": 2 } }, { "kind": "assignment", "id": 3, "source_line": 121, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100003, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 121, "signal_id": 3 } }, { "kind": "assignment", "id": 4, "source_line": 122, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100004, "is_sliced": false, "rhs": { "kind": "ternary", "width": 16, "source_line": 122, "condition": { "kind": "logical_and", "width": 1, "source_line": 122, "left": { "kind": "binary_eq", "width": 1, "source_line": 122, "left": { "kind": "signal_ref", "width": 1, "source_line": 122, "signal_id": 3 }, "right": { "kind": "literal", "width": 1, "source_line": 122, "literal": { "value": 1, "width": 1 } } }, "right": { "kind": "binary_eq", "width": 1, "source_line": 122, "left": { "kind": "signal_ref", "width": 1, "source_line": 122, "signal_id": 2 }, "right": { "kind": "literal", "width": 1, "source_line": 122, "literal": { "value": 1, "width": 1 } } } }, "true": { "kind": "signal_ref", "width": 16, "source_line": 122, "signal_id": 4 }, "false": { "kind": "literal", "width": 16, "source_line": 122, "literal": { "value": 0, "width": 16, "is_z": true } } } }, { "kind": "assignment", "id": 5, "source_line": 124, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 16, "source_line": 124, "signal_id": 100004 } }, { "kind": "assignment", "id": 6, "source_line": 125, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 125, "signal_id": 100005 } }] }
      },
      {
        "id": 1,
        "name": "ram_wrapper",
        "base_module_id": -1,
        "source_line": 129,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 131,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 132,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "sel",
          "kind": "port",
          "width": 3,
          "owner_module_id": 1,
          "source_line": 133,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "addr",
          "kind": "port",
          "width": 13,
          "owner_module_id": 1,
          "source_line": 134,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "cmd",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 135,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 5,
          "name": "valid",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 136,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 6,
          "name": "din",
          "kind": "port",
          "width": 16,
          "owner_module_id": 1,
          "source_line": 137,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 7,
          "name": "dout",
          "kind": "port",
          "width": 16,
          "owner_module_id": 1,
          "source_line": 138,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 8,
          "name": "done_out",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 139,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 9,
          "name": "bus",
          "kind": "net",
          "width": 35,
          "owner_module_id": 1,
          "source_line": 143,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
          {
            "id": 0,
            "name": "drv0",
            "child_module_id": 0,
            "connections": [{ "parent_signal_id": 2, "child_port_id": 0 }, { "parent_signal_id": 3, "child_port_id": 1 }, { "parent_signal_id": 4, "child_port_id": 2 }, { "parent_signal_id": 5, "child_port_id": 3 }, { "parent_signal_id": 6, "child_port_id": 4 }, { "parent_signal_id": 7, "child_port_id": 5 }, { "parent_signal_id": 8, "child_port_id": 6 }, { "parent_signal_id": 9, "child_port_id": 100000, "parent_msb": 2, "parent_lsb": 0 }, { "parent_signal_id": 9, "child_port_id": 100001, "parent_msb": 15, "parent_lsb": 3 }, { "parent_signal_id": 9, "child_port_id": 100002, "parent_msb": 16, "parent_lsb": 16 }, { "parent_signal_id": 9, "child_port_id": 100003, "parent_msb": 17, "parent_lsb": 17 }, { "parent_signal_id": 9, "child_port_id": 100004, "parent_msb": 33, "parent_lsb": 18 }, { "parent_signal_id": 9, "child_port_id": 100005, "parent_msb": 34, "parent_lsb": 34 }]
          },
          {
            "id": 1,
            "name": "ram0",
            "child_module_id": 2,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": 2, "child_port_id": 2 }, { "parent_signal_id": 9, "child_port_id": 100000, "parent_msb": 2, "parent_lsb": 0 }, { "parent_signal_id": 9, "child_port_id": 100001, "parent_msb": 15, "parent_lsb": 3 }, { "parent_signal_id": 9, "child_port_id": 100002, "parent_msb": 16, "parent_lsb": 16 }, { "parent_signal_id": 9, "child_port_id": 100003, "parent_msb": 17, "parent_lsb": 17 }, { "parent_signal_id": 9, "child_port_id": 100004, "parent_msb": 33, "parent_lsb": 18 }, { "parent_signal_id": 9, "child_port_id": 100005, "parent_msb": 34, "parent_lsb": 34 }]
          }
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": null
      },
      {
        "id": 2,
        "name": "ram",
        "base_module_id": -1,
        "source_line": 165,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 167,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 168,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "sel",
          "kind": "port",
          "width": 3,
          "owner_module_id": 2,
          "source_line": 169,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100000,
          "name": "pbus_SEL",
          "kind": "port",
          "width": 3,
          "owner_module_id": 2,
          "source_line": 84,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100001,
          "name": "pbus_ADDR",
          "kind": "port",
          "width": 13,
          "owner_module_id": 2,
          "source_line": 85,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100002,
          "name": "pbus_CMD",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 86,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100003,
          "name": "pbus_VALID",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 87,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100004,
          "name": "pbus_DATA",
          "kind": "port",
          "width": 16,
          "owner_module_id": 2,
          "source_line": 88,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "INOUT" }
        },
        {
          "id": 100005,
          "name": "pbus_DONE",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 89,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "pending_read",
          "kind": "register",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 182,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 1 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 5,
          "name": "data_ready",
          "kind": "register",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 183,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 1 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 6,
          "name": "read_data",
          "kind": "register",
          "width": 16,
          "owner_module_id": 2,
          "source_line": 184,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 16 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 200000,
          "name": "ram_read_addr",
          "kind": "register",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 0,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [5, 6, 4, 200000],
            "reset_signal_id": 1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 203, "condition": { "kind": "logical_not", "width": 1, "source_line": 203, "operand": { "kind": "signal_ref", "width": 1, "source_line": 203, "signal_id": 1 } }, "then": { "kind": "block", "source_line": 203, "statements": [{ "kind": "assignment", "id": 6, "source_line": 203, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 203, "literal": { "value": 0, "width": 1 } } }, { "kind": "assignment", "id": 7, "source_line": 203, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "literal", "width": 16, "source_line": 203, "literal": { "value": 0, "width": 16 } } }, { "kind": "assignment", "id": 8, "source_line": 203, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 203, "literal": { "value": 0, "width": 1 } } }, { "kind": "assignment", "id": 9, "source_line": 203, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 200000, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 203, "literal": { "value": 0, "width": 8 } } }] }, "else": { "kind": "block", "source_line": 203, "statements": [{ "kind": "if", "source_line": 208, "condition": { "kind": "binary_eq", "width": 1, "source_line": 208, "left": { "kind": "signal_ref", "width": 1, "source_line": 208, "signal_id": 5 }, "right": { "kind": "literal", "width": 1, "source_line": 208, "literal": { "value": 1, "width": 1 } } }, "then": { "kind": "block", "source_line": 208, "statements": [{ "kind": "assignment", "id": 0, "source_line": 210, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 210, "literal": { "value": 0, "width": 1 } } }] }, "elif_chain": [{ "kind": "if", "source_line": 211, "condition": { "kind": "binary_eq", "width": 1, "source_line": 211, "left": { "kind": "signal_ref", "width": 1, "source_line": 211, "signal_id": 4 }, "right": { "kind": "literal", "width": 1, "source_line": 211, "literal": { "value": 1, "width": 1 } } }, "then": { "kind": "block", "source_line": 211, "statements": [{ "kind": "assignment", "id": 1, "source_line": 213, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "mem_read", "width": 16, "source_line": 213, "memory_name": "ram", "port_name": "read", "address": null } }, { "kind": "assignment", "id": 2, "source_line": 214, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 214, "literal": { "value": 1, "width": 1 } } }, { "kind": "assignment", "id": 3, "source_line": 215, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 215, "literal": { "value": 0, "width": 1 } } }] } }, { "kind": "if", "source_line": 216, "condition": { "kind": "logical_and", "width": 1, "source_line": 216, "left": { "kind": "logical_and", "width": 1, "source_line": 216, "left": { "kind": "binary_eq", "width": 1, "source_line": 216, "left": { "kind": "signal_ref", "width": 3, "source_line": 216, "signal_id": 100000 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 216, "signal_id": 2 } }, "right": { "kind": "signal_ref", "width": 1, "source_line": 216, "signal_id": 100003 } }, "right": { "kind": "binary_eq", "width": 1, "source_line": 216, "left": { "kind": "signal_ref", "width": 1, "source_line": 216, "signal_id": 100002 }, "right": { "kind": "literal", "width": 1, "source_line": 216, "literal": { "value": 0, "width": 1 } } } }, "then": { "kind": "block", "source_line": 216, "statements": [{ "kind": "assignment", "id": 4, "source_line": 218, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 200000, "is_sliced": false, "rhs": { "kind": "slice", "width": 8, "source_line": 218, "signal_id": 100001, "msb": 7, "lsb": 0 } }, { "kind": "assignment", "id": 5, "source_line": 219, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 219, "literal": { "value": 1, "width": 1 } } }] } }] }, { "kind": "if", "source_line": 223, "condition": { "kind": "logical_and", "width": 1, "source_line": 223, "left": { "kind": "logical_and", "width": 1, "source_line": 223, "left": { "kind": "binary_eq", "width": 1, "source_line": 223, "left": { "kind": "signal_ref", "width": 3, "source_line": 223, "signal_id": 100000 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 223, "signal_id": 2 } }, "right": { "kind": "signal_ref", "width": 1, "source_line": 223, "signal_id": 100003 } }, "right": { "kind": "binary_eq", "width": 1, "source_line": 223, "left": { "kind": "signal_ref", "width": 1, "source_line": 223, "signal_id": 100002 }, "right": { "kind": "literal", "width": 1, "source_line": 223, "literal": { "value": 1, "width": 1 } } } }, "then": { "kind": "block", "source_line": 223, "statements": [{ "kind": "mem_write", "source_line": 224, "memory_name": "ram", "port_name": "write", "address": { "kind": "slice", "width": 8, "source_line": 224, "signal_id": 100001, "msb": 7, "lsb": 0 }, "data": { "kind": "signal_ref", "width": 16, "source_line": 224, "signal_id": 100004 } }] } }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
          {
            "id": 0,
            "name": "ram",
            "type": "BLOCK",
            "word_width": 16,
            "depth": 256,
            "address_width": 8,
            "init_literal": { "value": 0, "width": 16 },
            "ports": [
              { "name": "write", "kind": "WRITE", "address_width": 8, "write_mode": "WRITE_FIRST", "data_in_signal_id": 100004 },
              { "name": "read", "kind": "READ_SYNC", "address_width": 8, "data_out_signal_id": 6 }
            ]
          }
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 187, "statements": [{ "kind": "assignment", "id": 0, "source_line": 189, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100004, "is_sliced": false, "rhs": { "kind": "ternary", "width": 16, "source_line": 189, "condition": { "kind": "logical_and", "width": 1, "source_line": 189, "left": { "kind": "logical_and", "width": 1, "source_line": 189, "left": { "kind": "logical_and", "width": 1, "source_line": 189, "left": { "kind": "binary_eq", "width": 1, "source_line": 189, "left": { "kind": "signal_ref", "width": 3, "source_line": 189, "signal_id": 100000 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 189, "signal_id": 2 } }, "right": { "kind": "signal_ref", "width": 1, "source_line": 189, "signal_id": 100003 } }, "right": { "kind": "binary_eq", "width": 1, "source_line": 189, "left": { "kind": "signal_ref", "width": 1, "source_line": 189, "signal_id": 100002 }, "right": { "kind": "literal", "width": 1, "source_line": 189, "literal": { "value": 0, "width": 1 } } } }, "right": { "kind": "binary_eq", "width": 1, "source_line": 189, "left": { "kind": "signal_ref", "width": 1, "source_line": 189, "signal_id": 5 }, "right": { "kind": "literal", "width": 1, "source_line": 189, "literal": { "value": 1, "width": 1 } } } }, "true": { "kind": "signal_ref", "width": 16, "source_line": 189, "signal_id": 6 }, "false": { "kind": "literal", "width": 16, "source_line": 189, "literal": { "value": 0, "width": 16, "is_z": true } } } }, { "kind": "if", "source_line": 192, "condition": { "kind": "logical_and", "width": 1, "source_line": 192, "left": { "kind": "binary_eq", "width": 1, "source_line": 192, "left": { "kind": "signal_ref", "width": 3, "source_line": 192, "signal_id": 100000 }, "right": { "kind": "signal_ref", "width": 3, "source_line": 192, "signal_id": 2 } }, "right": { "kind": "signal_ref", "width": 1, "source_line": 192, "signal_id": 100003 } }, "then": { "kind": "block", "source_line": 192, "statements": [{ "kind": "if", "source_line": 193, "condition": { "kind": "logical_or", "width": 1, "source_line": 193, "left": { "kind": "binary_eq", "width": 1, "source_line": 193, "left": { "kind": "signal_ref", "width": 1, "source_line": 193, "signal_id": 100002 }, "right": { "kind": "literal", "width": 1, "source_line": 193, "literal": { "value": 1, "width": 1 } } }, "right": { "kind": "binary_eq", "width": 1, "source_line": 193, "left": { "kind": "signal_ref", "width": 1, "source_line": 193, "signal_id": 5 }, "right": { "kind": "literal", "width": 1, "source_line": 193, "literal": { "value": 1, "width": 1 } } } }, "then": { "kind": "block", "source_line": 193, "statements": [{ "kind": "assignment", "id": 1, "source_line": 194, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100005, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 194, "literal": { "value": 1, "width": 1 } } }] }, "else": { "kind": "block", "source_line": 195, "statements": [{ "kind": "assignment", "id": 2, "source_line": 196, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100005, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 196, "literal": { "value": 0, "width": 1 } } }] } }] }, "else": { "kind": "block", "source_line": 198, "statements": [{ "kind": "assignment", "id": 3, "source_line": 199, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100005, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 199, "literal": { "value": 0, "width": 1, "is_z": true } } }] } }] }
      }
    ],
    "project": {
      "name": "semi_dual_port_bsram_project",
      "clocks": [
        { "name": "clk", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "clk", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "rst_n", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "sel", "kind": "IN", "width": 3, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "addr", "kind": "IN", "width": 13, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "cmd", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 5, "name": "valid", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 6, "name": "din", "kind": "IN", "width": 16, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 7, "name": "dout", "kind": "OUT", "width": 16, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 8, "name": "done_out", "kind": "OUT", "width": 1, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "clk", "bit_index": -1, "board_pin_id": "1" },
        { "logical_pin_name": "rst_n", "bit_index": -1, "board_pin_id": "2" },
        { "logical_pin_name": "sel", "bit_index": 0, "board_pin_id": "3" },
        { "logical_pin_name": "sel", "bit_index": 1, "board_pin_id": "4" },
        { "logical_pin_name": "sel", "bit_index": 2, "board_pin_id": "5" },
        { "logical_pin_name": "addr", "bit_index": 0, "board_pin_id": "6" },
        { "logical_pin_name": "addr", "bit_index": 1, "board_pin_id": "7" },
        { "logical_pin_name": "addr", "bit_index": 2, "board_pin_id": "8" },
        { "logical_pin_name": "addr", "bit_index": 3, "board_pin_id": "9" },
        { "logical_pin_name": "addr", "bit_index": 4, "board_pin_id": "10" },
        { "logical_pin_name": "addr", "bit_index": 5, "board_pin_id": "11" },
        { "logical_pin_name": "addr", "bit_index": 6, "board_pin_id": "12" },
        { "logical_pin_name": "addr", "bit_index": 7, "board_pin_id": "13" },
        { "logical_pin_name": "addr", "bit_index": 8, "board_pin_id": "14" },
        { "logical_pin_name": "addr", "bit_index": 9, "board_pin_id": "15" },
        { "logical_pin_name": "addr", "bit_index": 10, "board_pin_id": "16" },
        { "logical_pin_name": "addr", "bit_index": 11, "board_pin_id": "17" },
        { "logical_pin_name": "addr", "bit_index": 12, "board_pin_id": "18" },
        { "logical_pin_name": "cmd", "bit_index": -1, "board_pin_id": "19" },
        { "logical_pin_name": "valid", "bit_index": -1, "board_pin_id": "20" },
        { "logical_pin_name": "din", "bit_index": 0, "board_pin_id": "21" },
        { "logical_pin_name": "din", "bit_index": 1, "board_pin_id": "22" },
        { "logical_pin_name": "din", "bit_index": 2, "board_pin_id": "23" },
        { "logical_pin_name": "din", "bit_index": 3, "board_pin_id": "24" },
        { "logical_pin_name": "din", "bit_index": 4, "board_pin_id": "25" },
        { "logical_pin_name": "din", "bit_index": 5, "board_pin_id": "26" },
        { "logical_pin_name": "din", "bit_index": 6, "board_pin_id": "27" },
        { "logical_pin_name": "din", "bit_index": 7, "board_pin_id": "28" },
        { "logical_pin_name": "din", "bit_index": 8, "board_pin_id": "29" },
        { "logical_pin_name": "din", "bit_index": 9, "board_pin_id": "30" },
        { "logical_pin_name": "din", "bit_index": 10, "board_pin_id": "31" },
        { "logical_pin_name": "din", "bit_index": 11, "board_pin_id": "32" },
        { "logical_pin_name": "din", "bit_index": 12, "board_pin_id": "33" },
        { "logical_pin_name": "din", "bit_index": 13, "board_pin_id": "34" },
        { "logical_pin_name": "din", "bit_index": 14, "board_pin_id": "35" },
        { "logical_pin_name": "din", "bit_index": 15, "board_pin_id": "36" },
        { "logical_pin_name": "dout", "bit_index": 0, "board_pin_id": "37" },
        { "logical_pin_name": "dout", "bit_index": 1, "board_pin_id": "38" },
        { "logical_pin_name": "dout", "bit_index": 2, "board_pin_id": "39" },
        { "logical_pin_name": "dout", "bit_index": 3, "board_pin_id": "40" },
        { "logical_pin_name": "dout", "bit_index": 4, "board_pin_id": "41" },
        { "logical_pin_name": "dout", "bit_index": 5, "board_pin_id": "42" },
        { "logical_pin_name": "dout", "bit_index": 6, "board_pin_id": "43" },
        { "logical_pin_name": "dout", "bit_index": 7, "board_pin_id": "44" },
        { "logical_pin_name": "dout", "bit_index": 8, "board_pin_id": "45" },
        { "logical_pin_name": "dout", "bit_index": 9, "board_pin_id": "46" },
        { "logical_pin_name": "dout", "bit_index": 10, "board_pin_id": "47" },
        { "logical_pin_name": "dout", "bit_index": 11, "board_pin_id": "48" },
        { "logical_pin_name": "dout", "bit_index": 12, "board_pin_id": "49" },
        { "logical_pin_name": "dout", "bit_index": 13, "board_pin_id": "50" },
        { "logical_pin_name": "dout", "bit_index": 14, "board_pin_id": "51" },
        { "logical_pin_name": "dout", "bit_index": 15, "board_pin_id": "52" },
        { "logical_pin_name": "done_out", "bit_index": -1, "board_pin_id": "53" }
      ],
      "top_module_id": 1,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 8, "pin_id": 3, "pin_bit_index": 8 },
        { "top_port_signal_id": 3, "top_bit_index": 9, "pin_id": 3, "pin_bit_index": 9 },
        { "top_port_signal_id": 3, "top_bit_index": 10, "pin_id": 3, "pin_bit_index": 10 },
        { "top_port_signal_id": 3, "top_bit_index": 11, "pin_id": 3, "pin_bit_index": 11 },
        { "top_port_signal_id": 3, "top_bit_index": 12, "pin_id": 3, "pin_bit_index": 12 },
        { "top_port_signal_id": 4, "top_bit_index": -1, "pin_id": 4, "pin_bit_index": -1 },
        { "top_port_signal_id": 5, "top_bit_index": -1, "pin_id": 5, "pin_bit_index": -1 },
        { "top_port_signal_id": 6, "top_bit_index": 0, "pin_id": 6, "pin_bit_index": 0 },
        { "top_port_signal_id": 6, "top_bit_index": 1, "pin_id": 6, "pin_bit_index": 1 },
        { "top_port_signal_id": 6, "top_bit_index": 2, "pin_id": 6, "pin_bit_index": 2 },
        { "top_port_signal_id": 6, "top_bit_index": 3, "pin_id": 6, "pin_bit_index": 3 },
        { "top_port_signal_id": 6, "top_bit_index": 4, "pin_id": 6, "pin_bit_index": 4 },
        { "top_port_signal_id": 6, "top_bit_index": 5, "pin_id": 6, "pin_bit_index": 5 },
        { "top_port_signal_id": 6, "top_bit_index": 6, "pin_id": 6, "pin_bit_index": 6 },
        { "top_port_signal_id": 6, "top_bit_index": 7, "pin_id": 6, "pin_bit_index": 7 },
        { "top_port_signal_id": 6, "top_bit_index": 8, "pin_id": 6, "pin_bit_index": 8 },
        { "top_port_signal_id": 6, "top_bit_index": 9, "pin_id": 6, "pin_bit_index": 9 },
        { "top_port_signal_id": 6, "top_bit_index": 10, "pin_id": 6, "pin_bit_index": 10 },
        { "top_port_signal_id": 6, "top_bit_index": 11, "pin_id": 6, "pin_bit_index": 11 },
        { "top_port_signal_id": 6, "top_bit_index": 12, "pin_id": 6, "pin_bit_index": 12 },
        { "top_port_signal_id": 6, "top_bit_index": 13, "pin_id": 6, "pin_bit_index": 13 },
        { "top_port_signal_id": 6, "top_bit_index": 14, "pin_id": 6, "pin_bit_index": 14 },
        { "top_port_signal_id": 6, "top_bit_index": 15, "pin_id": 6, "pin_bit_index": 15 },
        { "top_port_signal_id": 7, "top_bit_index": 0, "pin_id": 7, "pin_bit_index": 0 },
        { "top_port_signal_id": 7, "top_bit_index": 1, "pin_id": 7, "pin_bit_index": 1 },
        { "top_port_signal_id": 7, "top_bit_index": 2, "pin_id": 7, "pin_bit_index": 2 },
        { "top_port_signal_id": 7, "top_bit_index": 3, "pin_id": 7, "pin_bit_index": 3 },
        { "top_port_signal_id": 7, "top_bit_index": 4, "pin_id": 7, "pin_bit_index": 4 },
        { "top_port_signal_id": 7, "top_bit_index": 5, "pin_id": 7, "pin_bit_index": 5 },
        { "top_port_signal_id": 7, "top_bit_index": 6, "pin_id": 7, "pin_bit_index": 6 },
        { "top_port_signal_id": 7, "top_bit_index": 7, "pin_id": 7, "pin_bit_index": 7 },
        { "top_port_signal_id": 7, "top_bit_index": 8, "pin_id": 7, "pin_bit_index": 8 },
        { "top_port_signal_id": 7, "top_bit_index": 9, "pin_id": 7, "pin_bit_index": 9 },
        { "top_port_signal_id": 7, "top_bit_index": 10, "pin_id": 7, "pin_bit_index": 10 },
        { "top_port_signal_id": 7, "top_bit_index": 11, "pin_id": 7, "pin_bit_index": 11 },
        { "top_port_signal_id": 7, "top_bit_index": 12, "pin_id": 7, "pin_bit_index": 12 },
        { "top_port_signal_id": 7, "top_bit_index": 13, "pin_id": 7, "pin_bit_index": 13 },
        { "top_port_signal_id": 7, "top_bit_index": 14, "pin_id": 7, "pin_bit_index": 14 },
        { "top_port_signal_id": 7, "top_bit_index": 15, "pin_id": 7, "pin_bit_index": 15 },
        { "top_port_signal_id": 8, "top_bit_index": -1, "pin_id": 8, "pin_bit_index": -1 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 227 }
    ]
  }
}
