{
  "ir_version": "0.1.0",
  "design": {
    "name": "latch_test",
    "modules": [
      {
        "id": 0,
        "name": "latch_module",
        "base_module_id": -1,
        "source_line": 54,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "enable",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 56,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "data_in",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 57,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "iob_out",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 58,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 3,
          "name": "comb_out",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 59,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "iob_latch",
          "kind": "latch",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 64,
          "can_be_z": false,
          "iob": true
        },
        {
          "id": 5,
          "name": "cfu_latch",
          "kind": "latch",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 66,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 69, "statements": [{ "kind": "assignment", "id": 0, "source_line": 71, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "ternary", "width": 8, "source_line": 71, "condition": { "kind": "signal_ref", "width": 1, "source_line": 71, "signal_id": 0 }, "true": { "kind": "signal_ref", "width": 8, "source_line": 71, "signal_id": 1 }, "false": { "kind": "signal_ref", "width": 8, "source_line": 71, "signal_id": 4 } } }, { "kind": "assignment", "id": 1, "source_line": 72, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "ternary", "width": 8, "source_line": 72, "condition": { "kind": "signal_ref", "width": 1, "source_line": 72, "signal_id": 0 }, "true": { "kind": "signal_ref", "width": 8, "source_line": 72, "signal_id": 1 }, "false": { "kind": "signal_ref", "width": 8, "source_line": 72, "signal_id": 5 } } }, { "kind": "assignment", "id": 2, "source_line": 75, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 75, "signal_id": 4 } }, { "kind": "assignment", "id": 3, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "binary_xor", "width": 8, "source_line": 78, "left": { "kind": "signal_ref", "width": 8, "source_line": 78, "signal_id": 5 }, "right": { "kind": "literal", "width": 8, "source_line": 78, "literal": { "value": 255, "width": 8 } } } }] }
      }
    ],
    "project": {
      "name": "latch_test",
      "clocks": [
        { "name": "sys_clk", "period_ns": 37.04, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "sys_clk", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "enable", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "data_in", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "iob_out", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "comb_out", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "sys_clk", "bit_index": -1, "board_pin_id": "52" },
        { "logical_pin_name": "enable", "bit_index": -1, "board_pin_id": "3" },
        { "logical_pin_name": "data_in", "bit_index": 0, "board_pin_id": "25" },
        { "logical_pin_name": "data_in", "bit_index": 1, "board_pin_id": "26" },
        { "logical_pin_name": "data_in", "bit_index": 2, "board_pin_id": "27" },
        { "logical_pin_name": "data_in", "bit_index": 3, "board_pin_id": "28" },
        { "logical_pin_name": "data_in", "bit_index": 4, "board_pin_id": "29" },
        { "logical_pin_name": "data_in", "bit_index": 5, "board_pin_id": "30" },
        { "logical_pin_name": "data_in", "bit_index": 6, "board_pin_id": "31" },
        { "logical_pin_name": "data_in", "bit_index": 7, "board_pin_id": "32" },
        { "logical_pin_name": "iob_out", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "iob_out", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "iob_out", "bit_index": 2, "board_pin_id": "13" },
        { "logical_pin_name": "iob_out", "bit_index": 3, "board_pin_id": "14" },
        { "logical_pin_name": "iob_out", "bit_index": 4, "board_pin_id": "15" },
        { "logical_pin_name": "iob_out", "bit_index": 5, "board_pin_id": "16" },
        { "logical_pin_name": "iob_out", "bit_index": 6, "board_pin_id": "17" },
        { "logical_pin_name": "iob_out", "bit_index": 7, "board_pin_id": "18" },
        { "logical_pin_name": "comb_out", "bit_index": 0, "board_pin_id": "33" },
        { "logical_pin_name": "comb_out", "bit_index": 1, "board_pin_id": "34" },
        { "logical_pin_name": "comb_out", "bit_index": 2, "board_pin_id": "35" },
        { "logical_pin_name": "comb_out", "bit_index": 3, "board_pin_id": "36" },
        { "logical_pin_name": "comb_out", "bit_index": 4, "board_pin_id": "37" },
        { "logical_pin_name": "comb_out", "bit_index": 5, "board_pin_id": "38" },
        { "logical_pin_name": "comb_out", "bit_index": 6, "board_pin_id": "39" },
        { "logical_pin_name": "comb_out", "bit_index": 7, "board_pin_id": "40" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 1, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 1, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 1, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 1, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 1, "top_bit_index": 5, "pin_id": 2, "pin_bit_index": 5 },
        { "top_port_signal_id": 1, "top_bit_index": 6, "pin_id": 2, "pin_bit_index": 6 },
        { "top_port_signal_id": 1, "top_bit_index": 7, "pin_id": 2, "pin_bit_index": 7 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 4, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 4, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 4, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 4, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 4, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 4, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 4, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 4, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 80 }
    ]
  }
}
