{
  "ir_version": "0.1.0",
  "design": {
    "name": "template_test_project",
    "modules": [
      {
        "id": 0,
        "name": "template_demo",
        "base_module_id": -1,
        "source_line": 29,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "data_in",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 35,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "data_out",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 36,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 2,
          "name": "pass",
          "kind": "net",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 40,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 3,
          "name": "tap",
          "kind": "net",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 41,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 4,
          "name": "EXPAND__tmp__0_0",
          "kind": "net",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 45,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 5,
          "name": "EXPAND__tmp__0_1",
          "kind": "net",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 45,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 52, "statements": [{ "kind": "assignment", "id": 0, "source_line": 53, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 4, "source_line": 53, "signal_id": 0 } }, { "kind": "assignment", "id": 1, "source_line": 47, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 47, "signal_id": 2, "msb": 0, "lsb": 0 } }, { "kind": "assignment", "id": 2, "source_line": 49, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 3, "is_sliced": true, "lhs_msb": 0, "lhs_lsb": 0, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 49, "signal_id": 4 } }, { "kind": "assignment", "id": 3, "source_line": 47, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 47, "signal_id": 2, "msb": 1, "lsb": 1 } }, { "kind": "assignment", "id": 4, "source_line": 49, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 3, "is_sliced": true, "lhs_msb": 1, "lhs_lsb": 1, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 49, "signal_id": 5 } }, { "kind": "assignment", "id": 5, "source_line": 57, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 1, "is_sliced": true, "lhs_msb": 0, "lhs_lsb": 0, "rhs": { "kind": "slice", "width": 1, "source_line": 57, "signal_id": 3, "msb": 0, "lsb": 0 } }, { "kind": "assignment", "id": 6, "source_line": 58, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 1, "is_sliced": true, "lhs_msb": 1, "lhs_lsb": 1, "rhs": { "kind": "slice", "width": 1, "source_line": 58, "signal_id": 3, "msb": 1, "lsb": 1 } }, { "kind": "assignment", "id": 7, "source_line": 59, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 1, "is_sliced": true, "lhs_msb": 2, "lhs_lsb": 2, "rhs": { "kind": "slice", "width": 1, "source_line": 59, "signal_id": 2, "msb": 2, "lsb": 2 } }, { "kind": "assignment", "id": 8, "source_line": 60, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 1, "is_sliced": true, "lhs_msb": 3, "lhs_lsb": 3, "rhs": { "kind": "slice", "width": 1, "source_line": 60, "signal_id": 2, "msb": 3, "lsb": 3 } }] }
      }
    ],
    "project": {
      "name": "template_test_project",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "in_a", "kind": "IN", "width": 4, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "out_a", "kind": "OUT", "width": 4, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "in_a", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "in_a", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "in_a", "bit_index": 2, "board_pin_id": "12" },
        { "logical_pin_name": "in_a", "bit_index": 3, "board_pin_id": "13" },
        { "logical_pin_name": "out_a", "bit_index": 0, "board_pin_id": "20" },
        { "logical_pin_name": "out_a", "bit_index": 1, "board_pin_id": "21" },
        { "logical_pin_name": "out_a", "bit_index": 2, "board_pin_id": "22" },
        { "logical_pin_name": "out_a", "bit_index": 3, "board_pin_id": "23" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": 0, "pin_id": 0, "pin_bit_index": 0 },
        { "top_port_signal_id": 0, "top_bit_index": 1, "pin_id": 0, "pin_bit_index": 1 },
        { "top_port_signal_id": 0, "top_bit_index": 2, "pin_id": 0, "pin_bit_index": 2 },
        { "top_port_signal_id": 0, "top_bit_index": 3, "pin_id": 0, "pin_bit_index": 3 },
        { "top_port_signal_id": 1, "top_bit_index": 0, "pin_id": 1, "pin_bit_index": 0 },
        { "top_port_signal_id": 1, "top_bit_index": 1, "pin_id": 1, "pin_bit_index": 1 },
        { "top_port_signal_id": 1, "top_bit_index": 2, "pin_id": 1, "pin_bit_index": 2 },
        { "top_port_signal_id": 1, "top_bit_index": 3, "pin_id": 1, "pin_bit_index": 3 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 62 }
    ]
  }
}
