{
  "ir_version": "0.1.0",
  "design": {
    "name": "SafeArithTest",
    "modules": [
      {
        "id": 0,
        "name": "SafeArithCore",
        "base_module_id": -1,
        "source_line": 55,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 57,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 58,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "a",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 59,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "b",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 60,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "udiff",
          "kind": "port",
          "width": 9,
          "owner_module_id": 0,
          "source_line": 61,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 5,
          "name": "sdiff",
          "kind": "port",
          "width": 9,
          "owner_module_id": 0,
          "source_line": 62,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 6,
          "name": "absv",
          "kind": "port",
          "width": 9,
          "owner_module_id": 0,
          "source_line": 63,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 66, "statements": [{ "kind": "assignment", "id": 0, "source_line": 67, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "intrinsic_usub", "width": 9, "source_line": 67, "left": { "kind": "signal_ref", "width": 8, "source_line": 67, "signal_id": 2 }, "right": { "kind": "signal_ref", "width": 8, "source_line": 67, "signal_id": 3 } } }, { "kind": "assignment", "id": 1, "source_line": 68, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "intrinsic_ssub", "width": 9, "source_line": 68, "left": { "kind": "signal_ref", "width": 8, "source_line": 68, "signal_id": 2 }, "right": { "kind": "signal_ref", "width": 8, "source_line": 68, "signal_id": 3 } } }, { "kind": "assignment", "id": 2, "source_line": 69, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "intrinsic_abs", "width": 9, "source_line": 69, "source": { "kind": "signal_ref", "width": 8, "source_line": 69, "signal_id": 2 } } }] }
      }
    ],
    "project": {
      "name": "SafeArithTest",
      "clocks": [
        { "name": "SCLK", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "SCLK", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "DONE", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "a", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "b", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "udiff", "kind": "OUT", "width": 9, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 5, "name": "sdiff", "kind": "OUT", "width": 9, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 6, "name": "absv", "kind": "OUT", "width": 9, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "SCLK", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "DONE", "bit_index": -1, "board_pin_id": "IOR32B" },
        { "logical_pin_name": "a", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "a", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "a", "bit_index": 2, "board_pin_id": "12" },
        { "logical_pin_name": "a", "bit_index": 3, "board_pin_id": "13" },
        { "logical_pin_name": "a", "bit_index": 4, "board_pin_id": "14" },
        { "logical_pin_name": "a", "bit_index": 5, "board_pin_id": "15" },
        { "logical_pin_name": "a", "bit_index": 6, "board_pin_id": "16" },
        { "logical_pin_name": "a", "bit_index": 7, "board_pin_id": "17" },
        { "logical_pin_name": "b", "bit_index": 0, "board_pin_id": "20" },
        { "logical_pin_name": "b", "bit_index": 1, "board_pin_id": "21" },
        { "logical_pin_name": "b", "bit_index": 2, "board_pin_id": "22" },
        { "logical_pin_name": "b", "bit_index": 3, "board_pin_id": "23" },
        { "logical_pin_name": "b", "bit_index": 4, "board_pin_id": "24" },
        { "logical_pin_name": "b", "bit_index": 5, "board_pin_id": "25" },
        { "logical_pin_name": "b", "bit_index": 6, "board_pin_id": "26" },
        { "logical_pin_name": "b", "bit_index": 7, "board_pin_id": "27" },
        { "logical_pin_name": "udiff", "bit_index": 0, "board_pin_id": "30" },
        { "logical_pin_name": "udiff", "bit_index": 1, "board_pin_id": "31" },
        { "logical_pin_name": "udiff", "bit_index": 2, "board_pin_id": "32" },
        { "logical_pin_name": "udiff", "bit_index": 3, "board_pin_id": "33" },
        { "logical_pin_name": "udiff", "bit_index": 4, "board_pin_id": "34" },
        { "logical_pin_name": "udiff", "bit_index": 5, "board_pin_id": "35" },
        { "logical_pin_name": "udiff", "bit_index": 6, "board_pin_id": "36" },
        { "logical_pin_name": "udiff", "bit_index": 7, "board_pin_id": "37" },
        { "logical_pin_name": "udiff", "bit_index": 8, "board_pin_id": "38" },
        { "logical_pin_name": "sdiff", "bit_index": 0, "board_pin_id": "39" },
        { "logical_pin_name": "sdiff", "bit_index": 1, "board_pin_id": "40" },
        { "logical_pin_name": "sdiff", "bit_index": 2, "board_pin_id": "41" },
        { "logical_pin_name": "sdiff", "bit_index": 3, "board_pin_id": "42" },
        { "logical_pin_name": "sdiff", "bit_index": 4, "board_pin_id": "43" },
        { "logical_pin_name": "sdiff", "bit_index": 5, "board_pin_id": "44" },
        { "logical_pin_name": "sdiff", "bit_index": 6, "board_pin_id": "45" },
        { "logical_pin_name": "sdiff", "bit_index": 7, "board_pin_id": "46" },
        { "logical_pin_name": "sdiff", "bit_index": 8, "board_pin_id": "47" },
        { "logical_pin_name": "absv", "bit_index": 0, "board_pin_id": "48" },
        { "logical_pin_name": "absv", "bit_index": 1, "board_pin_id": "49" },
        { "logical_pin_name": "absv", "bit_index": 2, "board_pin_id": "50" },
        { "logical_pin_name": "absv", "bit_index": 3, "board_pin_id": "51" },
        { "logical_pin_name": "absv", "bit_index": 4, "board_pin_id": "52" },
        { "logical_pin_name": "absv", "bit_index": 5, "board_pin_id": "53" },
        { "logical_pin_name": "absv", "bit_index": 6, "board_pin_id": "54" },
        { "logical_pin_name": "absv", "bit_index": 7, "board_pin_id": "55" },
        { "logical_pin_name": "absv", "bit_index": 8, "board_pin_id": "56" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 2, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 2, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 2, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 },
        { "top_port_signal_id": 4, "top_bit_index": 0, "pin_id": 4, "pin_bit_index": 0 },
        { "top_port_signal_id": 4, "top_bit_index": 1, "pin_id": 4, "pin_bit_index": 1 },
        { "top_port_signal_id": 4, "top_bit_index": 2, "pin_id": 4, "pin_bit_index": 2 },
        { "top_port_signal_id": 4, "top_bit_index": 3, "pin_id": 4, "pin_bit_index": 3 },
        { "top_port_signal_id": 4, "top_bit_index": 4, "pin_id": 4, "pin_bit_index": 4 },
        { "top_port_signal_id": 4, "top_bit_index": 5, "pin_id": 4, "pin_bit_index": 5 },
        { "top_port_signal_id": 4, "top_bit_index": 6, "pin_id": 4, "pin_bit_index": 6 },
        { "top_port_signal_id": 4, "top_bit_index": 7, "pin_id": 4, "pin_bit_index": 7 },
        { "top_port_signal_id": 4, "top_bit_index": 8, "pin_id": 4, "pin_bit_index": 8 },
        { "top_port_signal_id": 5, "top_bit_index": 0, "pin_id": 5, "pin_bit_index": 0 },
        { "top_port_signal_id": 5, "top_bit_index": 1, "pin_id": 5, "pin_bit_index": 1 },
        { "top_port_signal_id": 5, "top_bit_index": 2, "pin_id": 5, "pin_bit_index": 2 },
        { "top_port_signal_id": 5, "top_bit_index": 3, "pin_id": 5, "pin_bit_index": 3 },
        { "top_port_signal_id": 5, "top_bit_index": 4, "pin_id": 5, "pin_bit_index": 4 },
        { "top_port_signal_id": 5, "top_bit_index": 5, "pin_id": 5, "pin_bit_index": 5 },
        { "top_port_signal_id": 5, "top_bit_index": 6, "pin_id": 5, "pin_bit_index": 6 },
        { "top_port_signal_id": 5, "top_bit_index": 7, "pin_id": 5, "pin_bit_index": 7 },
        { "top_port_signal_id": 5, "top_bit_index": 8, "pin_id": 5, "pin_bit_index": 8 },
        { "top_port_signal_id": 6, "top_bit_index": 0, "pin_id": 6, "pin_bit_index": 0 },
        { "top_port_signal_id": 6, "top_bit_index": 1, "pin_id": 6, "pin_bit_index": 1 },
        { "top_port_signal_id": 6, "top_bit_index": 2, "pin_id": 6, "pin_bit_index": 2 },
        { "top_port_signal_id": 6, "top_bit_index": 3, "pin_id": 6, "pin_bit_index": 3 },
        { "top_port_signal_id": 6, "top_bit_index": 4, "pin_id": 6, "pin_bit_index": 4 },
        { "top_port_signal_id": 6, "top_bit_index": 5, "pin_id": 6, "pin_bit_index": 5 },
        { "top_port_signal_id": 6, "top_bit_index": 6, "pin_id": 6, "pin_bit_index": 6 },
        { "top_port_signal_id": 6, "top_bit_index": 7, "pin_id": 6, "pin_bit_index": 7 },
        { "top_port_signal_id": 6, "top_bit_index": 8, "pin_id": 6, "pin_bit_index": 8 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 71 }
    ]
  }
}
