{
  "ir_version": "0.1.0",
  "design": {
    "name": "comb_select_default_test",
    "modules": [
      {
        "id": 0,
        "name": "select_palette",
        "base_module_id": -1,
        "source_line": 51,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "fg_idx",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 53,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "bg_idx",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 54,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "pixel_x",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 55,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "active",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 56,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "bitmap",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 57,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 5,
          "name": "red",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 58,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 6,
          "name": "green",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 59,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 7,
          "name": "blue",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 60,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 8,
          "name": "fg_r",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 64,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 9,
          "name": "fg_g",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 65,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 10,
          "name": "fg_b",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 66,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 11,
          "name": "bg_r",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 67,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 12,
          "name": "bg_g",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 68,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 13,
          "name": "bg_b",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 69,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 14,
          "name": "pixel_on",
          "kind": "net",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 70,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 73, "statements": [{ "kind": "select", "source_line": 75, "selector": { "kind": "signal_ref", "width": 4, "source_line": 75, "signal_id": 0 }, "cases": [{ "case_value": { "kind": "literal", "width": 4, "source_line": 76, "literal": { "value": 0, "width": 4 } }, "body": { "kind": "block", "source_line": 76, "statements": [{ "kind": "assignment", "id": 0, "source_line": 76, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 76, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 1, "source_line": 76, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 76, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 2, "source_line": 76, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 76, "literal": { "value": 0, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 77, "literal": { "value": 1, "width": 4 } }, "body": { "kind": "block", "source_line": 77, "statements": [{ "kind": "assignment", "id": 3, "source_line": 77, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 77, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 4, "source_line": 77, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 77, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 5, "source_line": 77, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 77, "literal": { "value": 0, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 78, "literal": { "value": 2, "width": 4 } }, "body": { "kind": "block", "source_line": 78, "statements": [{ "kind": "assignment", "id": 6, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 78, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 7, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 78, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 8, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 78, "literal": { "value": 0, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 79, "literal": { "value": 3, "width": 4 } }, "body": { "kind": "block", "source_line": 79, "statements": [{ "kind": "assignment", "id": 9, "source_line": 79, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 79, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 10, "source_line": 79, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 79, "literal": { "value": 85, "width": 8 } } }, { "kind": "assignment", "id": 11, "source_line": 79, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 79, "literal": { "value": 0, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 80, "literal": { "value": 4, "width": 4 } }, "body": { "kind": "block", "source_line": 80, "statements": [{ "kind": "assignment", "id": 12, "source_line": 80, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 80, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 13, "source_line": 80, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 80, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 14, "source_line": 80, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 80, "literal": { "value": 170, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 81, "literal": { "value": 5, "width": 4 } }, "body": { "kind": "block", "source_line": 81, "statements": [{ "kind": "assignment", "id": 15, "source_line": 81, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 81, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 16, "source_line": 81, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 81, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 17, "source_line": 81, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 81, "literal": { "value": 170, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 82, "literal": { "value": 6, "width": 4 } }, "body": { "kind": "block", "source_line": 82, "statements": [{ "kind": "assignment", "id": 18, "source_line": 82, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 82, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 19, "source_line": 82, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 82, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 20, "source_line": 82, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 82, "literal": { "value": 170, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 83, "literal": { "value": 7, "width": 4 } }, "body": { "kind": "block", "source_line": 83, "statements": [{ "kind": "assignment", "id": 21, "source_line": 83, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 83, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 22, "source_line": 83, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 83, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 23, "source_line": 83, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 83, "literal": { "value": 170, "width": 8 } } }] } }, { "case_value": null, "body": { "kind": "block", "source_line": 84, "statements": [{ "kind": "assignment", "id": 24, "source_line": 84, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 84, "literal": { "value": 85, "width": 8 } } }, { "kind": "assignment", "id": 25, "source_line": 84, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 84, "literal": { "value": 85, "width": 8 } } }, { "kind": "assignment", "id": 26, "source_line": 84, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 10, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 84, "literal": { "value": 85, "width": 8 } } }] } }] }, { "kind": "select", "source_line": 88, "selector": { "kind": "signal_ref", "width": 4, "source_line": 88, "signal_id": 1 }, "cases": [{ "case_value": { "kind": "literal", "width": 4, "source_line": 89, "literal": { "value": 0, "width": 4 } }, "body": { "kind": "block", "source_line": 89, "statements": [{ "kind": "assignment", "id": 27, "source_line": 89, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 89, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 28, "source_line": 89, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 89, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 29, "source_line": 89, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 89, "literal": { "value": 0, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 90, "literal": { "value": 1, "width": 4 } }, "body": { "kind": "block", "source_line": 90, "statements": [{ "kind": "assignment", "id": 30, "source_line": 90, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 90, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 31, "source_line": 90, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 90, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 32, "source_line": 90, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 90, "literal": { "value": 0, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 91, "literal": { "value": 2, "width": 4 } }, "body": { "kind": "block", "source_line": 91, "statements": [{ "kind": "assignment", "id": 33, "source_line": 91, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 91, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 34, "source_line": 91, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 91, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 35, "source_line": 91, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 91, "literal": { "value": 0, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 92, "literal": { "value": 3, "width": 4 } }, "body": { "kind": "block", "source_line": 92, "statements": [{ "kind": "assignment", "id": 36, "source_line": 92, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 92, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 37, "source_line": 92, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 92, "literal": { "value": 85, "width": 8 } } }, { "kind": "assignment", "id": 38, "source_line": 92, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 92, "literal": { "value": 0, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 93, "literal": { "value": 4, "width": 4 } }, "body": { "kind": "block", "source_line": 93, "statements": [{ "kind": "assignment", "id": 39, "source_line": 93, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 93, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 40, "source_line": 93, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 93, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 41, "source_line": 93, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 93, "literal": { "value": 170, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 94, "literal": { "value": 5, "width": 4 } }, "body": { "kind": "block", "source_line": 94, "statements": [{ "kind": "assignment", "id": 42, "source_line": 94, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 94, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 43, "source_line": 94, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 94, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 44, "source_line": 94, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 94, "literal": { "value": 170, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 95, "literal": { "value": 6, "width": 4 } }, "body": { "kind": "block", "source_line": 95, "statements": [{ "kind": "assignment", "id": 45, "source_line": 95, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 95, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 46, "source_line": 95, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 95, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 47, "source_line": 95, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 95, "literal": { "value": 170, "width": 8 } } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 96, "literal": { "value": 7, "width": 4 } }, "body": { "kind": "block", "source_line": 96, "statements": [{ "kind": "assignment", "id": 48, "source_line": 96, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 96, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 49, "source_line": 96, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 96, "literal": { "value": 170, "width": 8 } } }, { "kind": "assignment", "id": 50, "source_line": 96, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 96, "literal": { "value": 170, "width": 8 } } }] } }, { "case_value": null, "body": { "kind": "block", "source_line": 97, "statements": [{ "kind": "assignment", "id": 51, "source_line": 97, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 11, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 97, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 52, "source_line": 97, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 12, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 97, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 53, "source_line": 97, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 13, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 97, "literal": { "value": 0, "width": 8 } } }] } }] }, { "kind": "if", "source_line": 101, "condition": { "kind": "binary_eq", "width": 1, "source_line": 101, "left": { "kind": "signal_ref", "width": 1, "source_line": 101, "signal_id": 3 }, "right": { "kind": "literal", "width": 1, "source_line": 101, "literal": { "value": 0, "width": 1 } } }, "then": { "kind": "block", "source_line": 101, "statements": [{ "kind": "assignment", "id": 54, "source_line": 102, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 102, "literal": { "value": 0, "width": 1 } } }] }, "else": { "kind": "block", "source_line": 103, "statements": [{ "kind": "select", "source_line": 104, "selector": { "kind": "signal_ref", "width": 4, "source_line": 104, "signal_id": 2 }, "cases": [{ "case_value": { "kind": "literal", "width": 4, "source_line": 105, "literal": { "value": 0, "width": 4 } }, "body": { "kind": "block", "source_line": 105, "statements": [{ "kind": "assignment", "id": 55, "source_line": 105, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 105, "signal_id": 4, "msb": 7, "lsb": 7 } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 106, "literal": { "value": 1, "width": 4 } }, "body": { "kind": "block", "source_line": 106, "statements": [{ "kind": "assignment", "id": 56, "source_line": 106, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 106, "signal_id": 4, "msb": 6, "lsb": 6 } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 107, "literal": { "value": 2, "width": 4 } }, "body": { "kind": "block", "source_line": 107, "statements": [{ "kind": "assignment", "id": 57, "source_line": 107, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 107, "signal_id": 4, "msb": 5, "lsb": 5 } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 108, "literal": { "value": 3, "width": 4 } }, "body": { "kind": "block", "source_line": 108, "statements": [{ "kind": "assignment", "id": 58, "source_line": 108, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 108, "signal_id": 4, "msb": 4, "lsb": 4 } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 109, "literal": { "value": 4, "width": 4 } }, "body": { "kind": "block", "source_line": 109, "statements": [{ "kind": "assignment", "id": 59, "source_line": 109, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 109, "signal_id": 4, "msb": 3, "lsb": 3 } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 110, "literal": { "value": 5, "width": 4 } }, "body": { "kind": "block", "source_line": 110, "statements": [{ "kind": "assignment", "id": 60, "source_line": 110, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 110, "signal_id": 4, "msb": 2, "lsb": 2 } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 111, "literal": { "value": 6, "width": 4 } }, "body": { "kind": "block", "source_line": 111, "statements": [{ "kind": "assignment", "id": 61, "source_line": 111, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 111, "signal_id": 4, "msb": 1, "lsb": 1 } }] } }, { "case_value": { "kind": "literal", "width": 4, "source_line": 112, "literal": { "value": 7, "width": 4 } }, "body": { "kind": "block", "source_line": 112, "statements": [{ "kind": "assignment", "id": 62, "source_line": 112, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 112, "signal_id": 4, "msb": 0, "lsb": 0 } }] } }, { "case_value": null, "body": { "kind": "block", "source_line": 113, "statements": [{ "kind": "assignment", "id": 63, "source_line": 113, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 14, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 113, "literal": { "value": 0, "width": 1 } } }] } }] }] } }, { "kind": "if", "source_line": 118, "condition": { "kind": "binary_eq", "width": 1, "source_line": 118, "left": { "kind": "signal_ref", "width": 1, "source_line": 118, "signal_id": 14 }, "right": { "kind": "literal", "width": 1, "source_line": 118, "literal": { "value": 1, "width": 1 } } }, "then": { "kind": "block", "source_line": 118, "statements": [{ "kind": "assignment", "id": 64, "source_line": 119, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 119, "signal_id": 8 } }, { "kind": "assignment", "id": 65, "source_line": 120, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 120, "signal_id": 9 } }, { "kind": "assignment", "id": 66, "source_line": 121, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 121, "signal_id": 10 } }] }, "else": { "kind": "block", "source_line": 122, "statements": [{ "kind": "assignment", "id": 67, "source_line": 123, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 123, "signal_id": 11 } }, { "kind": "assignment", "id": 68, "source_line": 124, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 124, "signal_id": 12 } }, { "kind": "assignment", "id": 69, "source_line": 125, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 125, "signal_id": 13 } }] } }] }
      }
    ],
    "project": {
      "name": "comb_select_default_test",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "fg_in", "kind": "IN", "width": 4, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "bg_in", "kind": "IN", "width": 4, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "px_in", "kind": "IN", "width": 4, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "act_in", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "bmp_in", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 5, "name": "r_out", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 6, "name": "g_out", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 7, "name": "b_out", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "fg_in", "bit_index": 0, "board_pin_id": "0" },
        { "logical_pin_name": "fg_in", "bit_index": 1, "board_pin_id": "1" },
        { "logical_pin_name": "fg_in", "bit_index": 2, "board_pin_id": "2" },
        { "logical_pin_name": "fg_in", "bit_index": 3, "board_pin_id": "3" },
        { "logical_pin_name": "bg_in", "bit_index": 0, "board_pin_id": "4" },
        { "logical_pin_name": "bg_in", "bit_index": 1, "board_pin_id": "5" },
        { "logical_pin_name": "bg_in", "bit_index": 2, "board_pin_id": "6" },
        { "logical_pin_name": "bg_in", "bit_index": 3, "board_pin_id": "7" },
        { "logical_pin_name": "px_in", "bit_index": 0, "board_pin_id": "8" },
        { "logical_pin_name": "px_in", "bit_index": 1, "board_pin_id": "9" },
        { "logical_pin_name": "px_in", "bit_index": 2, "board_pin_id": "10" },
        { "logical_pin_name": "px_in", "bit_index": 3, "board_pin_id": "11" },
        { "logical_pin_name": "act_in", "bit_index": -1, "board_pin_id": "12" },
        { "logical_pin_name": "bmp_in", "bit_index": 0, "board_pin_id": "13" },
        { "logical_pin_name": "bmp_in", "bit_index": 1, "board_pin_id": "14" },
        { "logical_pin_name": "bmp_in", "bit_index": 2, "board_pin_id": "15" },
        { "logical_pin_name": "bmp_in", "bit_index": 3, "board_pin_id": "16" },
        { "logical_pin_name": "bmp_in", "bit_index": 4, "board_pin_id": "17" },
        { "logical_pin_name": "bmp_in", "bit_index": 5, "board_pin_id": "18" },
        { "logical_pin_name": "bmp_in", "bit_index": 6, "board_pin_id": "19" },
        { "logical_pin_name": "bmp_in", "bit_index": 7, "board_pin_id": "20" },
        { "logical_pin_name": "r_out", "bit_index": 0, "board_pin_id": "30" },
        { "logical_pin_name": "r_out", "bit_index": 1, "board_pin_id": "31" },
        { "logical_pin_name": "r_out", "bit_index": 2, "board_pin_id": "32" },
        { "logical_pin_name": "r_out", "bit_index": 3, "board_pin_id": "33" },
        { "logical_pin_name": "r_out", "bit_index": 4, "board_pin_id": "34" },
        { "logical_pin_name": "r_out", "bit_index": 5, "board_pin_id": "35" },
        { "logical_pin_name": "r_out", "bit_index": 6, "board_pin_id": "36" },
        { "logical_pin_name": "r_out", "bit_index": 7, "board_pin_id": "37" },
        { "logical_pin_name": "g_out", "bit_index": 0, "board_pin_id": "38" },
        { "logical_pin_name": "g_out", "bit_index": 1, "board_pin_id": "39" },
        { "logical_pin_name": "g_out", "bit_index": 2, "board_pin_id": "40" },
        { "logical_pin_name": "g_out", "bit_index": 3, "board_pin_id": "41" },
        { "logical_pin_name": "g_out", "bit_index": 4, "board_pin_id": "42" },
        { "logical_pin_name": "g_out", "bit_index": 5, "board_pin_id": "43" },
        { "logical_pin_name": "g_out", "bit_index": 6, "board_pin_id": "44" },
        { "logical_pin_name": "g_out", "bit_index": 7, "board_pin_id": "45" },
        { "logical_pin_name": "b_out", "bit_index": 0, "board_pin_id": "46" },
        { "logical_pin_name": "b_out", "bit_index": 1, "board_pin_id": "47" },
        { "logical_pin_name": "b_out", "bit_index": 2, "board_pin_id": "48" },
        { "logical_pin_name": "b_out", "bit_index": 3, "board_pin_id": "49" },
        { "logical_pin_name": "b_out", "bit_index": 4, "board_pin_id": "50" },
        { "logical_pin_name": "b_out", "bit_index": 5, "board_pin_id": "51" },
        { "logical_pin_name": "b_out", "bit_index": 6, "board_pin_id": "52" },
        { "logical_pin_name": "b_out", "bit_index": 7, "board_pin_id": "53" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": 0, "pin_id": 0, "pin_bit_index": 0 },
        { "top_port_signal_id": 0, "top_bit_index": 1, "pin_id": 0, "pin_bit_index": 1 },
        { "top_port_signal_id": 0, "top_bit_index": 2, "pin_id": 0, "pin_bit_index": 2 },
        { "top_port_signal_id": 0, "top_bit_index": 3, "pin_id": 0, "pin_bit_index": 3 },
        { "top_port_signal_id": 1, "top_bit_index": 0, "pin_id": 1, "pin_bit_index": 0 },
        { "top_port_signal_id": 1, "top_bit_index": 1, "pin_id": 1, "pin_bit_index": 1 },
        { "top_port_signal_id": 1, "top_bit_index": 2, "pin_id": 1, "pin_bit_index": 2 },
        { "top_port_signal_id": 1, "top_bit_index": 3, "pin_id": 1, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": -1, "pin_id": 3, "pin_bit_index": -1 },
        { "top_port_signal_id": 4, "top_bit_index": 0, "pin_id": 4, "pin_bit_index": 0 },
        { "top_port_signal_id": 4, "top_bit_index": 1, "pin_id": 4, "pin_bit_index": 1 },
        { "top_port_signal_id": 4, "top_bit_index": 2, "pin_id": 4, "pin_bit_index": 2 },
        { "top_port_signal_id": 4, "top_bit_index": 3, "pin_id": 4, "pin_bit_index": 3 },
        { "top_port_signal_id": 4, "top_bit_index": 4, "pin_id": 4, "pin_bit_index": 4 },
        { "top_port_signal_id": 4, "top_bit_index": 5, "pin_id": 4, "pin_bit_index": 5 },
        { "top_port_signal_id": 4, "top_bit_index": 6, "pin_id": 4, "pin_bit_index": 6 },
        { "top_port_signal_id": 4, "top_bit_index": 7, "pin_id": 4, "pin_bit_index": 7 },
        { "top_port_signal_id": 5, "top_bit_index": 0, "pin_id": 5, "pin_bit_index": 0 },
        { "top_port_signal_id": 5, "top_bit_index": 1, "pin_id": 5, "pin_bit_index": 1 },
        { "top_port_signal_id": 5, "top_bit_index": 2, "pin_id": 5, "pin_bit_index": 2 },
        { "top_port_signal_id": 5, "top_bit_index": 3, "pin_id": 5, "pin_bit_index": 3 },
        { "top_port_signal_id": 5, "top_bit_index": 4, "pin_id": 5, "pin_bit_index": 4 },
        { "top_port_signal_id": 5, "top_bit_index": 5, "pin_id": 5, "pin_bit_index": 5 },
        { "top_port_signal_id": 5, "top_bit_index": 6, "pin_id": 5, "pin_bit_index": 6 },
        { "top_port_signal_id": 5, "top_bit_index": 7, "pin_id": 5, "pin_bit_index": 7 },
        { "top_port_signal_id": 6, "top_bit_index": 0, "pin_id": 6, "pin_bit_index": 0 },
        { "top_port_signal_id": 6, "top_bit_index": 1, "pin_id": 6, "pin_bit_index": 1 },
        { "top_port_signal_id": 6, "top_bit_index": 2, "pin_id": 6, "pin_bit_index": 2 },
        { "top_port_signal_id": 6, "top_bit_index": 3, "pin_id": 6, "pin_bit_index": 3 },
        { "top_port_signal_id": 6, "top_bit_index": 4, "pin_id": 6, "pin_bit_index": 4 },
        { "top_port_signal_id": 6, "top_bit_index": 5, "pin_id": 6, "pin_bit_index": 5 },
        { "top_port_signal_id": 6, "top_bit_index": 6, "pin_id": 6, "pin_bit_index": 6 },
        { "top_port_signal_id": 6, "top_bit_index": 7, "pin_id": 6, "pin_bit_index": 7 },
        { "top_port_signal_id": 7, "top_bit_index": 0, "pin_id": 7, "pin_bit_index": 0 },
        { "top_port_signal_id": 7, "top_bit_index": 1, "pin_id": 7, "pin_bit_index": 1 },
        { "top_port_signal_id": 7, "top_bit_index": 2, "pin_id": 7, "pin_bit_index": 2 },
        { "top_port_signal_id": 7, "top_bit_index": 3, "pin_id": 7, "pin_bit_index": 3 },
        { "top_port_signal_id": 7, "top_bit_index": 4, "pin_id": 7, "pin_bit_index": 4 },
        { "top_port_signal_id": 7, "top_bit_index": 5, "pin_id": 7, "pin_bit_index": 5 },
        { "top_port_signal_id": 7, "top_bit_index": 6, "pin_id": 7, "pin_bit_index": 6 },
        { "top_port_signal_id": 7, "top_bit_index": 7, "pin_id": 7, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 128 }
    ]
  }
}
