{
  "ir_version": "0.1.0",
  "design": {
    "name": "PriencLzcTest",
    "modules": [
      {
        "id": 0,
        "name": "PriencLzcCore",
        "base_module_id": -1,
        "source_line": 42,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 44,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 45,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "src8",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 46,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "pri8",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 47,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "lzc8",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 48,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 51, "statements": [{ "kind": "assignment", "id": 0, "source_line": 52, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "intrinsic_prienc", "width": 3, "source_line": 52, "source": { "kind": "signal_ref", "width": 8, "source_line": 52, "signal_id": 2 } } }, { "kind": "assignment", "id": 1, "source_line": 53, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "intrinsic_lzc", "width": 4, "source_line": 53, "source": { "kind": "signal_ref", "width": 8, "source_line": 53, "signal_id": 2 } } }] }
      }
    ],
    "project": {
      "name": "PriencLzcTest",
      "clocks": [
        { "name": "SCLK", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "SCLK", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "DONE", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "src8", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "pri8", "kind": "OUT", "width": 3, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "lzc8", "kind": "OUT", "width": 4, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "SCLK", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "DONE", "bit_index": -1, "board_pin_id": "IOR32B" },
        { "logical_pin_name": "src8", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "src8", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "src8", "bit_index": 2, "board_pin_id": "12" },
        { "logical_pin_name": "src8", "bit_index": 3, "board_pin_id": "13" },
        { "logical_pin_name": "src8", "bit_index": 4, "board_pin_id": "14" },
        { "logical_pin_name": "src8", "bit_index": 5, "board_pin_id": "15" },
        { "logical_pin_name": "src8", "bit_index": 6, "board_pin_id": "16" },
        { "logical_pin_name": "src8", "bit_index": 7, "board_pin_id": "17" },
        { "logical_pin_name": "pri8", "bit_index": 0, "board_pin_id": "30" },
        { "logical_pin_name": "pri8", "bit_index": 1, "board_pin_id": "31" },
        { "logical_pin_name": "pri8", "bit_index": 2, "board_pin_id": "32" },
        { "logical_pin_name": "lzc8", "bit_index": 0, "board_pin_id": "33" },
        { "logical_pin_name": "lzc8", "bit_index": 1, "board_pin_id": "34" },
        { "logical_pin_name": "lzc8", "bit_index": 2, "board_pin_id": "35" },
        { "logical_pin_name": "lzc8", "bit_index": 3, "board_pin_id": "36" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 2, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 2, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 2, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 4, "top_bit_index": 0, "pin_id": 4, "pin_bit_index": 0 },
        { "top_port_signal_id": 4, "top_bit_index": 1, "pin_id": 4, "pin_bit_index": 1 },
        { "top_port_signal_id": 4, "top_bit_index": 2, "pin_id": 4, "pin_bit_index": 2 },
        { "top_port_signal_id": 4, "top_bit_index": 3, "pin_id": 4, "pin_bit_index": 3 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 55 }
    ]
  }
}
