{
  "ir_version": "0.1.0",
  "design": {
    "name": "top_concat_test",
    "modules": [
      {
        "id": 0,
        "name": "concat_mod",
        "base_module_id": -1,
        "source_line": 49,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 51,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "btn",
          "kind": "port",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 52,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "bidir_in",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 53,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "leds",
          "kind": "port",
          "width": 6,
          "owner_module_id": 0,
          "source_line": 54,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "count",
          "kind": "register",
          "width": 5,
          "owner_module_id": 0,
          "source_line": 58,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 5 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [4],
            "reset_signal_id": -1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "block", "source_line": 65, "statements": [{ "kind": "assignment", "id": 0, "source_line": 66, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 5, "source_line": 66, "left": { "kind": "signal_ref", "width": 5, "source_line": 66, "signal_id": 4 }, "right": { "kind": "concat", "width": 5, "source_line": 66, "operands": [{ "kind": "literal", "width": 3, "source_line": 66, "literal": { "value": 0, "width": 3 } }, { "kind": "signal_ref", "width": 2, "source_line": 66, "signal_id": 1 }] } } }] }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 61, "statements": [{ "kind": "assignment", "id": 0, "source_line": 62, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "concat", "width": 6, "source_line": 62, "operands": [{ "kind": "signal_ref", "width": 1, "source_line": 62, "signal_id": 2 }, { "kind": "signal_ref", "width": 5, "source_line": 62, "signal_id": 4 }] } }] }
      }
    ],
    "project": {
      "name": "top_concat_test",
      "clocks": [
        { "name": "SCLK", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "SCLK", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "BTN", "kind": "IN", "width": 2, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "LED", "kind": "OUT", "width": 5, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "BIDIR", "kind": "INOUT", "width": 1, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "SCLK", "bit_index": -1, "board_pin_id": "1" },
        { "logical_pin_name": "BTN", "bit_index": 0, "board_pin_id": "2" },
        { "logical_pin_name": "BTN", "bit_index": 1, "board_pin_id": "3" },
        { "logical_pin_name": "LED", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "LED", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "LED", "bit_index": 2, "board_pin_id": "12" },
        { "logical_pin_name": "LED", "bit_index": 3, "board_pin_id": "13" },
        { "logical_pin_name": "LED", "bit_index": 4, "board_pin_id": "14" },
        { "logical_pin_name": "BIDIR", "bit_index": -1, "board_pin_id": "20" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": 0, "pin_id": 1, "pin_bit_index": 0 },
        { "top_port_signal_id": 1, "top_bit_index": 1, "pin_id": 1, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": -1, "pin_id": 3, "pin_bit_index": -1 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 68 }
    ]
  }
}
