{
  "ir_version": "0.1.0",
  "design": {
    "name": "mux_validation_test",
    "modules": [
      {
        "id": 0,
        "name": "mux_demo_top",
        "base_module_id": -1,
        "source_line": 32,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "sel",
          "kind": "port",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 34,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "op_mode",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 35,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "data_out",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 36,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 3,
          "name": "ch_a",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 41,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 4,
          "name": "ch_b",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 42,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 5,
          "name": "ch_c",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 43,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 6,
          "name": "ch_d",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 44,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 7,
          "name": "pipeline_reg",
          "kind": "net",
          "width": 32,
          "owner_module_id": 0,
          "source_line": 47,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 60, "statements": [{ "kind": "assignment", "id": 0, "source_line": 62, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 62, "literal": { "value": 17, "width": 8 } } }, { "kind": "assignment", "id": 1, "source_line": 63, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 63, "literal": { "value": 34, "width": 8 } } }, { "kind": "assignment", "id": 2, "source_line": 64, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 64, "literal": { "value": 51, "width": 8 } } }, { "kind": "assignment", "id": 3, "source_line": 65, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 65, "literal": { "value": 68, "width": 8 } } }, { "kind": "assignment", "id": 4, "source_line": 68, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "literal", "width": 32, "source_line": 68, "literal": { "value": 2864434397, "width": 32 } } }, { "kind": "if", "source_line": 72, "condition": { "kind": "binary_eq", "width": 1, "source_line": 72, "left": { "kind": "signal_ref", "width": 1, "source_line": 72, "signal_id": 1 }, "right": { "kind": "literal", "width": 1, "source_line": 72, "literal": { "value": 1, "width": 1 } } }, "then": { "kind": "block", "source_line": 72, "statements": [{ "kind": "assignment", "id": 5, "source_line": 73, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "intrinsic_gslice", "width": 8, "source_line": 73, "source": { "kind": "concat", "width": 32, "source_line": 53, "operands": [{ "kind": "signal_ref", "width": 8, "source_line": 44, "signal_id": 6 }, { "kind": "signal_ref", "width": 8, "source_line": 43, "signal_id": 5 }, { "kind": "signal_ref", "width": 8, "source_line": 42, "signal_id": 4 }, { "kind": "signal_ref", "width": 8, "source_line": 41, "signal_id": 3 }] }, "index": { "kind": "signal_ref", "width": 2, "source_line": 73, "signal_id": 0 }, "element_width": 8 } }] }, "else": { "kind": "block", "source_line": 74, "statements": [{ "kind": "assignment", "id": 6, "source_line": 75, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "intrinsic_gslice", "width": 8, "source_line": 75, "source": { "kind": "signal_ref", "width": 32, "source_line": 47, "signal_id": 7 }, "index": { "kind": "signal_ref", "width": 2, "source_line": 75, "signal_id": 0 }, "element_width": 8 } }] } }] }
      }
    ],
    "project": {
      "name": "mux_validation_test",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "select", "kind": "IN", "width": 2, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "mode", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "byte_out", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "select", "bit_index": 0, "board_pin_id": "2" },
        { "logical_pin_name": "select", "bit_index": 1, "board_pin_id": "3" },
        { "logical_pin_name": "mode", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "byte_out", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "byte_out", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "byte_out", "bit_index": 2, "board_pin_id": "12" },
        { "logical_pin_name": "byte_out", "bit_index": 3, "board_pin_id": "13" },
        { "logical_pin_name": "byte_out", "bit_index": 4, "board_pin_id": "14" },
        { "logical_pin_name": "byte_out", "bit_index": 5, "board_pin_id": "15" },
        { "logical_pin_name": "byte_out", "bit_index": 6, "board_pin_id": "16" },
        { "logical_pin_name": "byte_out", "bit_index": 7, "board_pin_id": "17" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": 0, "pin_id": 0, "pin_bit_index": 0 },
        { "top_port_signal_id": 0, "top_bit_index": 1, "pin_id": 0, "pin_bit_index": 1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 2, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 2, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 2, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 78 }
    ]
  }
}
