{
  "ir_version": "0.1.0",
  "design": {
    "name": "feature_conditional_test",
    "modules": [
      {
        "id": 0,
        "name": "feature_module",
        "base_module_id": -1,
        "source_line": 46,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 52,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 53,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "data_in",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 54,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "data_out",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 55,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "counter",
          "kind": "register",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 59,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 8 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [4],
            "reset_signal_id": 1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 71, "condition": { "kind": "logical_not", "width": 1, "source_line": 71, "operand": { "kind": "signal_ref", "width": 1, "source_line": 71, "signal_id": 1 } }, "then": { "kind": "block", "source_line": 71, "statements": [{ "kind": "assignment", "id": 1, "source_line": 71, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 71, "literal": { "value": 0, "width": 8 } } }] }, "else": { "kind": "block", "source_line": 71, "statements": [{ "kind": "block", "source_line": 73, "statements": [{ "kind": "assignment", "id": 0, "source_line": 74, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 8, "source_line": 74, "left": { "kind": "signal_ref", "width": 8, "source_line": 74, "signal_id": 4 }, "right": { "kind": "literal", "width": 8, "source_line": 74, "literal": { "value": 1, "width": 8 } } } }] }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 62, "statements": [{ "kind": "block", "source_line": 64, "statements": [{ "kind": "assignment", "id": 0, "source_line": 65, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 65, "signal_id": 4 } }] }] }
      }
    ],
    "project": {
      "name": "feature_conditional_test",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "d_in", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "clk_in", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "rst_in", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "d_out", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "clk_in", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "rst_in", "bit_index": -1, "board_pin_id": "88" },
        { "logical_pin_name": "d_in", "bit_index": 0, "board_pin_id": "30" },
        { "logical_pin_name": "d_in", "bit_index": 1, "board_pin_id": "31" },
        { "logical_pin_name": "d_in", "bit_index": 2, "board_pin_id": "32" },
        { "logical_pin_name": "d_in", "bit_index": 3, "board_pin_id": "33" },
        { "logical_pin_name": "d_in", "bit_index": 4, "board_pin_id": "34" },
        { "logical_pin_name": "d_in", "bit_index": 5, "board_pin_id": "35" },
        { "logical_pin_name": "d_in", "bit_index": 6, "board_pin_id": "36" },
        { "logical_pin_name": "d_in", "bit_index": 7, "board_pin_id": "37" },
        { "logical_pin_name": "d_out", "bit_index": 0, "board_pin_id": "20" },
        { "logical_pin_name": "d_out", "bit_index": 1, "board_pin_id": "21" },
        { "logical_pin_name": "d_out", "bit_index": 2, "board_pin_id": "22" },
        { "logical_pin_name": "d_out", "bit_index": 3, "board_pin_id": "23" },
        { "logical_pin_name": "d_out", "bit_index": 4, "board_pin_id": "24" },
        { "logical_pin_name": "d_out", "bit_index": 5, "board_pin_id": "25" },
        { "logical_pin_name": "d_out", "bit_index": 6, "board_pin_id": "26" },
        { "logical_pin_name": "d_out", "bit_index": 7, "board_pin_id": "27" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 2, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 0, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 0, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 0, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 0, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 0, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 0, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 0, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 0, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 79 }
    ]
  }
}
