{
  "ir_version": "0.1.0",
  "design": {
    "name": "check_assertions_test",
    "modules": [
      {
        "id": 0,
        "name": "check_module",
        "base_module_id": -1,
        "source_line": 46,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "data_in",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 54,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "data_out",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 55,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 66, "statements": [{ "kind": "assignment", "id": 0, "source_line": 67, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 1, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 67, "signal_id": 0 } }] }
      }
    ],
    "project": {
      "name": "check_assertions_test",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "d_in", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "d_out", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "d_in", "bit_index": 0, "board_pin_id": "2" },
        { "logical_pin_name": "d_in", "bit_index": 1, "board_pin_id": "3" },
        { "logical_pin_name": "d_in", "bit_index": 2, "board_pin_id": "4" },
        { "logical_pin_name": "d_in", "bit_index": 3, "board_pin_id": "5" },
        { "logical_pin_name": "d_in", "bit_index": 4, "board_pin_id": "6" },
        { "logical_pin_name": "d_in", "bit_index": 5, "board_pin_id": "7" },
        { "logical_pin_name": "d_in", "bit_index": 6, "board_pin_id": "8" },
        { "logical_pin_name": "d_in", "bit_index": 7, "board_pin_id": "9" },
        { "logical_pin_name": "d_out", "bit_index": 0, "board_pin_id": "20" },
        { "logical_pin_name": "d_out", "bit_index": 1, "board_pin_id": "21" },
        { "logical_pin_name": "d_out", "bit_index": 2, "board_pin_id": "22" },
        { "logical_pin_name": "d_out", "bit_index": 3, "board_pin_id": "23" },
        { "logical_pin_name": "d_out", "bit_index": 4, "board_pin_id": "24" },
        { "logical_pin_name": "d_out", "bit_index": 5, "board_pin_id": "25" },
        { "logical_pin_name": "d_out", "bit_index": 6, "board_pin_id": "26" },
        { "logical_pin_name": "d_out", "bit_index": 7, "board_pin_id": "27" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": 0, "pin_id": 0, "pin_bit_index": 0 },
        { "top_port_signal_id": 0, "top_bit_index": 1, "pin_id": 0, "pin_bit_index": 1 },
        { "top_port_signal_id": 0, "top_bit_index": 2, "pin_id": 0, "pin_bit_index": 2 },
        { "top_port_signal_id": 0, "top_bit_index": 3, "pin_id": 0, "pin_bit_index": 3 },
        { "top_port_signal_id": 0, "top_bit_index": 4, "pin_id": 0, "pin_bit_index": 4 },
        { "top_port_signal_id": 0, "top_bit_index": 5, "pin_id": 0, "pin_bit_index": 5 },
        { "top_port_signal_id": 0, "top_bit_index": 6, "pin_id": 0, "pin_bit_index": 6 },
        { "top_port_signal_id": 0, "top_bit_index": 7, "pin_id": 0, "pin_bit_index": 7 },
        { "top_port_signal_id": 1, "top_bit_index": 0, "pin_id": 1, "pin_bit_index": 0 },
        { "top_port_signal_id": 1, "top_bit_index": 1, "pin_id": 1, "pin_bit_index": 1 },
        { "top_port_signal_id": 1, "top_bit_index": 2, "pin_id": 1, "pin_bit_index": 2 },
        { "top_port_signal_id": 1, "top_bit_index": 3, "pin_id": 1, "pin_bit_index": 3 },
        { "top_port_signal_id": 1, "top_bit_index": 4, "pin_id": 1, "pin_bit_index": 4 },
        { "top_port_signal_id": 1, "top_bit_index": 5, "pin_id": 1, "pin_bit_index": 5 },
        { "top_port_signal_id": 1, "top_bit_index": 6, "pin_id": 1, "pin_bit_index": 6 },
        { "top_port_signal_id": 1, "top_bit_index": 7, "pin_id": 1, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 69 }
    ]
  }
}
