{
  "ir_version": "0.1.0",
  "design": {
    "name": "TRISTATE_CONST_TEST",
    "modules": [
      {
        "id": 0,
        "name": "top_mod",
        "base_module_id": -1,
        "source_line": 65,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 73,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "sel",
          "kind": "port",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 74,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "wr_en",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 75,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "wr_data",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 76,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "leds",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 77,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 5,
          "name": "global_data",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 82,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 6,
          "name": "local_data",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 84,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 7,
          "name": "rf_out",
          "kind": "net",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 86,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
          {
            "id": 0,
            "name": "dev_global_a",
            "child_module_id": 1,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": -1, "child_port_id": 2, "const_expr": "2'b00" }, { "parent_signal_id": 5, "child_port_id": 3 }]
          },
          {
            "id": 1,
            "name": "dev_global_b",
            "child_module_id": 1,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": -1, "child_port_id": 2, "const_expr": "2'b01" }, { "parent_signal_id": 5, "child_port_id": 3 }]
          },
          {
            "id": 2,
            "name": "dev_global_c",
            "child_module_id": 1,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": -1, "child_port_id": 2, "const_expr": "2'b10" }, { "parent_signal_id": 5, "child_port_id": 3 }]
          },
          {
            "id": 3,
            "name": "dev_local_a",
            "child_module_id": 1,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": 6, "child_port_id": 3 }]
          },
          {
            "id": 4,
            "name": "dev_local_b",
            "child_module_id": 1,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": 6, "child_port_id": 3 }]
          },
          {
            "id": 5,
            "name": "regfile",
            "child_module_id": 2,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": 7, "child_port_id": 2 }, { "parent_signal_id": 2, "child_port_id": 3 }, { "parent_signal_id": 1, "child_port_id": 4 }, { "parent_signal_id": 3, "child_port_id": 5 }]
          }
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 148, "statements": [{ "kind": "assignment", "id": 0, "source_line": 150, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "binary_xor", "width": 8, "source_line": 150, "left": { "kind": "binary_xor", "width": 8, "source_line": 150, "left": { "kind": "signal_ref", "width": 8, "source_line": 150, "signal_id": 7 }, "right": { "kind": "signal_ref", "width": 8, "source_line": 150, "signal_id": 5 } }, "right": { "kind": "signal_ref", "width": 8, "source_line": 150, "signal_id": 6 } } }] }
      },
      {
        "id": 1,
        "name": "tristate_device",
        "base_module_id": -1,
        "source_line": 155,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 157,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "bus_sel",
          "kind": "port",
          "width": 2,
          "owner_module_id": 1,
          "source_line": 158,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "my_sel",
          "kind": "port",
          "width": 2,
          "owner_module_id": 1,
          "source_line": 159,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "data",
          "kind": "port",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 160,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "counter",
          "kind": "register",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 164,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 165, "width": 8 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [4],
            "reset_signal_id": -1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "block", "source_line": 172, "statements": [{ "kind": "assignment", "id": 0, "source_line": 173, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "binary_add", "width": 8, "source_line": 173, "left": { "kind": "signal_ref", "width": 8, "source_line": 173, "signal_id": 4 }, "right": { "kind": "literal", "width": 8, "source_line": 173, "literal": { "value": 1, "width": 8 } } } }] }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 167, "statements": [{ "kind": "assignment", "id": 0, "source_line": 169, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "ternary", "width": 8, "source_line": 169, "condition": { "kind": "binary_eq", "width": 1, "source_line": 169, "left": { "kind": "signal_ref", "width": 2, "source_line": 169, "signal_id": 1 }, "right": { "kind": "signal_ref", "width": 2, "source_line": 169, "signal_id": 2 } }, "true": { "kind": "signal_ref", "width": 8, "source_line": 169, "signal_id": 4 }, "false": { "kind": "literal", "width": 8, "source_line": 169, "literal": { "value": 0, "width": 8, "is_z": true } } } }] }
      },
      {
        "id": 2,
        "name": "register_file",
        "base_module_id": -1,
        "source_line": 178,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 180,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rd_sel",
          "kind": "port",
          "width": 2,
          "owner_module_id": 2,
          "source_line": 181,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "rd_data",
          "kind": "port",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 182,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 3,
          "name": "wr_en",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 183,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "wr_sel",
          "kind": "port",
          "width": 2,
          "owner_module_id": 2,
          "source_line": 184,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 5,
          "name": "wr_data",
          "kind": "port",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 185,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 6,
          "name": "zero_val",
          "kind": "net",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 189,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 7,
          "name": "r1",
          "kind": "register",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 196,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 17, "width": 8 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 8,
          "name": "r2",
          "kind": "register",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 197,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 34, "width": 8 }, "home_clock_domain_id": 0 }
        },
        {
          "id": 9,
          "name": "r3",
          "kind": "register",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 198,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 51, "width": 8 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [7, 8, 9],
            "reset_signal_id": -1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "block", "source_line": 211, "statements": [{ "kind": "if", "source_line": 212, "condition": { "kind": "binary_eq", "width": 1, "source_line": 212, "left": { "kind": "signal_ref", "width": 1, "source_line": 212, "signal_id": 3 }, "right": { "kind": "literal", "width": 1, "source_line": 212, "literal": { "value": 1, "width": 1 } } }, "then": { "kind": "block", "source_line": 212, "statements": [{ "kind": "select", "source_line": 213, "selector": { "kind": "signal_ref", "width": 2, "source_line": 213, "signal_id": 4 }, "cases": [{ "case_value": { "kind": "literal", "width": 2, "source_line": 214, "literal": { "value": 1, "width": 2 } }, "body": { "kind": "block", "source_line": 214, "statements": [{ "kind": "assignment", "id": 0, "source_line": 214, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 214, "signal_id": 5 } }] } }, { "case_value": { "kind": "literal", "width": 2, "source_line": 215, "literal": { "value": 2, "width": 2 } }, "body": { "kind": "block", "source_line": 215, "statements": [{ "kind": "assignment", "id": 1, "source_line": 215, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 215, "signal_id": 5 } }] } }, { "case_value": { "kind": "literal", "width": 2, "source_line": 216, "literal": { "value": 3, "width": 2 } }, "body": { "kind": "block", "source_line": 216, "statements": [{ "kind": "assignment", "id": 2, "source_line": 216, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 216, "signal_id": 5 } }] } }, { "case_value": null, "body": null }] }] } }] }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 206, "statements": [{ "kind": "assignment", "id": 0, "source_line": 207, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 207, "literal": { "value": 0, "width": 8 } } }, { "kind": "assignment", "id": 1, "source_line": 208, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 2, "is_sliced": false, "rhs": { "kind": "intrinsic_gslice", "width": 8, "source_line": 208, "source": { "kind": "concat", "width": 32, "source_line": 203, "operands": [{ "kind": "signal_ref", "width": 8, "source_line": 198, "signal_id": 9 }, { "kind": "signal_ref", "width": 8, "source_line": 197, "signal_id": 8 }, { "kind": "signal_ref", "width": 8, "source_line": 196, "signal_id": 7 }, { "kind": "signal_ref", "width": 8, "source_line": 189, "signal_id": 6 }] }, "index": { "kind": "signal_ref", "width": 2, "source_line": 208, "signal_id": 1 }, "element_width": 8 } }] }
      }
    ],
    "project": {
      "name": "TRISTATE_CONST_TEST",
      "clocks": [
        { "name": "MCLK", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "MCLK", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "SEL", "kind": "IN", "width": 2, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "WR_EN", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "WR_DATA", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "LEDS", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "MCLK", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "SEL", "bit_index": 0, "board_pin_id": "87" },
        { "logical_pin_name": "SEL", "bit_index": 1, "board_pin_id": "88" },
        { "logical_pin_name": "WR_EN", "bit_index": -1, "board_pin_id": "86" },
        { "logical_pin_name": "WR_DATA", "bit_index": 0, "board_pin_id": "73" },
        { "logical_pin_name": "WR_DATA", "bit_index": 1, "board_pin_id": "74" },
        { "logical_pin_name": "WR_DATA", "bit_index": 2, "board_pin_id": "75" },
        { "logical_pin_name": "WR_DATA", "bit_index": 3, "board_pin_id": "76" },
        { "logical_pin_name": "WR_DATA", "bit_index": 4, "board_pin_id": "77" },
        { "logical_pin_name": "WR_DATA", "bit_index": 5, "board_pin_id": "79" },
        { "logical_pin_name": "WR_DATA", "bit_index": 6, "board_pin_id": "80" },
        { "logical_pin_name": "WR_DATA", "bit_index": 7, "board_pin_id": "81" },
        { "logical_pin_name": "LEDS", "bit_index": 0, "board_pin_id": "15" },
        { "logical_pin_name": "LEDS", "bit_index": 1, "board_pin_id": "16" },
        { "logical_pin_name": "LEDS", "bit_index": 2, "board_pin_id": "17" },
        { "logical_pin_name": "LEDS", "bit_index": 3, "board_pin_id": "18" },
        { "logical_pin_name": "LEDS", "bit_index": 4, "board_pin_id": "19" },
        { "logical_pin_name": "LEDS", "bit_index": 5, "board_pin_id": "20" },
        { "logical_pin_name": "LEDS", "bit_index": 6, "board_pin_id": "21" },
        { "logical_pin_name": "LEDS", "bit_index": 7, "board_pin_id": "22" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": 0, "pin_id": 1, "pin_bit_index": 0 },
        { "top_port_signal_id": 1, "top_bit_index": 1, "pin_id": 1, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": -1, "pin_id": 2, "pin_bit_index": -1 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 },
        { "top_port_signal_id": 4, "top_bit_index": 0, "pin_id": 4, "pin_bit_index": 0 },
        { "top_port_signal_id": 4, "top_bit_index": 1, "pin_id": 4, "pin_bit_index": 1 },
        { "top_port_signal_id": 4, "top_bit_index": 2, "pin_id": 4, "pin_bit_index": 2 },
        { "top_port_signal_id": 4, "top_bit_index": 3, "pin_id": 4, "pin_bit_index": 3 },
        { "top_port_signal_id": 4, "top_bit_index": 4, "pin_id": 4, "pin_bit_index": 4 },
        { "top_port_signal_id": 4, "top_bit_index": 5, "pin_id": 4, "pin_bit_index": 5 },
        { "top_port_signal_id": 4, "top_bit_index": 6, "pin_id": 4, "pin_bit_index": 6 },
        { "top_port_signal_id": 4, "top_bit_index": 7, "pin_id": 4, "pin_bit_index": 7 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 221 }
    ]
  }
}
