{
  "ir_version": "0.1.0",
  "design": {
    "name": "Oh2bTest",
    "modules": [
      {
        "id": 0,
        "name": "Oh2bCore",
        "base_module_id": -1,
        "source_line": 50,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "clk",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 52,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "rst_n",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 53,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "onehot_in",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 54,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "sel4_in",
          "kind": "port",
          "width": 4,
          "owner_module_id": 0,
          "source_line": 55,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 4,
          "name": "index3",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 56,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 5,
          "name": "index2",
          "kind": "port",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 57,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 6,
          "name": "latched",
          "kind": "port",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 58,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 7,
          "name": "idx8",
          "kind": "net",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 63,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 8,
          "name": "idx4",
          "kind": "net",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 64,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 9,
          "name": "idx_reg",
          "kind": "register",
          "width": 3,
          "owner_module_id": 0,
          "source_line": 69,
          "can_be_z": false,
          "iob": false,
          "reg": { "reset_value": { "value": 0, "width": 3 }, "home_clock_domain_id": 0 }
        }
      ],
        "clock_domains": [
          {
            "id": 0,
            "clock_signal_id": 0,
            "edge": "RISING",
            "register_ids": [9],
            "reset_signal_id": 1,
            "reset_sync_signal_id": -1,
            "reset_active": "ACTIVE_LOW",
            "reset_type": "CLOCKED",
            "sensitivity_list": [{ "signal_id": 0, "edge": "RISING" }],
            "statements": { "kind": "if", "source_line": 85, "condition": { "kind": "logical_not", "width": 1, "source_line": 85, "operand": { "kind": "signal_ref", "width": 1, "source_line": 85, "signal_id": 1 } }, "then": { "kind": "block", "source_line": 85, "statements": [{ "kind": "assignment", "id": 1, "source_line": 85, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "literal", "width": 3, "source_line": 85, "literal": { "value": 0, "width": 3 } } }] }, "else": { "kind": "block", "source_line": 85, "statements": [{ "kind": "assignment", "id": 0, "source_line": 87, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 9, "is_sliced": false, "rhs": { "kind": "intrinsic_oh2b", "width": 3, "source_line": 87, "source": { "kind": "signal_ref", "width": 8, "source_line": 87, "signal_id": 2 } } }] } }
          }
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 72, "statements": [{ "kind": "assignment", "id": 0, "source_line": 74, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 7, "is_sliced": false, "rhs": { "kind": "intrinsic_oh2b", "width": 3, "source_line": 74, "source": { "kind": "signal_ref", "width": 8, "source_line": 74, "signal_id": 2 } } }, { "kind": "assignment", "id": 1, "source_line": 75, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 3, "source_line": 75, "signal_id": 7 } }, { "kind": "assignment", "id": 2, "source_line": 78, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 8, "is_sliced": false, "rhs": { "kind": "intrinsic_oh2b", "width": 2, "source_line": 78, "source": { "kind": "signal_ref", "width": 4, "source_line": 78, "signal_id": 3 } } }, { "kind": "assignment", "id": 3, "source_line": 79, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 5, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 2, "source_line": 79, "signal_id": 8 } }, { "kind": "assignment", "id": 4, "source_line": 82, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 6, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 3, "source_line": 82, "signal_id": 9 } }] }
      }
    ],
    "project": {
      "name": "Oh2bTest",
      "clocks": [
        { "name": "SCLK", "period_ns": 10, "edge": "RISING" }
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "SCLK", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "DONE", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "onehot", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "sel4", "kind": "IN", "width": 4, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "idx3", "kind": "OUT", "width": 3, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 5, "name": "idx2", "kind": "OUT", "width": 2, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 6, "name": "latched", "kind": "OUT", "width": 3, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "SCLK", "bit_index": -1, "board_pin_id": "4" },
        { "logical_pin_name": "DONE", "bit_index": -1, "board_pin_id": "IOR32B" },
        { "logical_pin_name": "onehot", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "onehot", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "onehot", "bit_index": 2, "board_pin_id": "12" },
        { "logical_pin_name": "onehot", "bit_index": 3, "board_pin_id": "13" },
        { "logical_pin_name": "onehot", "bit_index": 4, "board_pin_id": "14" },
        { "logical_pin_name": "onehot", "bit_index": 5, "board_pin_id": "15" },
        { "logical_pin_name": "onehot", "bit_index": 6, "board_pin_id": "16" },
        { "logical_pin_name": "onehot", "bit_index": 7, "board_pin_id": "17" },
        { "logical_pin_name": "sel4", "bit_index": 0, "board_pin_id": "20" },
        { "logical_pin_name": "sel4", "bit_index": 1, "board_pin_id": "21" },
        { "logical_pin_name": "sel4", "bit_index": 2, "board_pin_id": "22" },
        { "logical_pin_name": "sel4", "bit_index": 3, "board_pin_id": "23" },
        { "logical_pin_name": "idx3", "bit_index": 0, "board_pin_id": "30" },
        { "logical_pin_name": "idx3", "bit_index": 1, "board_pin_id": "31" },
        { "logical_pin_name": "idx3", "bit_index": 2, "board_pin_id": "32" },
        { "logical_pin_name": "idx2", "bit_index": 0, "board_pin_id": "33" },
        { "logical_pin_name": "idx2", "bit_index": 1, "board_pin_id": "34" },
        { "logical_pin_name": "latched", "bit_index": 0, "board_pin_id": "35" },
        { "logical_pin_name": "latched", "bit_index": 1, "board_pin_id": "36" },
        { "logical_pin_name": "latched", "bit_index": 2, "board_pin_id": "37" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": -1, "pin_id": 0, "pin_bit_index": -1 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 2, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 2, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 2, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 4, "top_bit_index": 0, "pin_id": 4, "pin_bit_index": 0 },
        { "top_port_signal_id": 4, "top_bit_index": 1, "pin_id": 4, "pin_bit_index": 1 },
        { "top_port_signal_id": 4, "top_bit_index": 2, "pin_id": 4, "pin_bit_index": 2 },
        { "top_port_signal_id": 5, "top_bit_index": 0, "pin_id": 5, "pin_bit_index": 0 },
        { "top_port_signal_id": 5, "top_bit_index": 1, "pin_id": 5, "pin_bit_index": 1 },
        { "top_port_signal_id": 6, "top_bit_index": 0, "pin_id": 6, "pin_bit_index": 0 },
        { "top_port_signal_id": 6, "top_bit_index": 1, "pin_id": 6, "pin_bit_index": 1 },
        { "top_port_signal_id": 6, "top_bit_index": 2, "pin_id": 6, "pin_bit_index": 2 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 89 }
    ]
  }
}
