{
  "ir_version": "0.1.0",
  "design": {
    "name": "ped_validation_project",
    "modules": [
      {
        "id": 0,
        "name": "ped_logic_module",
        "base_module_id": -1,
        "source_line": 44,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "sel",
          "kind": "port",
          "width": 2,
          "owner_module_id": 0,
          "source_line": 46,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "in_a",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 47,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "in_b",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 48,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "logic_out",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 49,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 4,
          "name": "indicator",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 50,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 53, "statements": [{ "kind": "if", "source_line": 56, "condition": { "kind": "binary_eq", "width": 1, "source_line": 56, "left": { "kind": "signal_ref", "width": 2, "source_line": 56, "signal_id": 0 }, "right": { "kind": "literal", "width": 2, "source_line": 56, "literal": { "value": 0, "width": 2 } } }, "then": { "kind": "block", "source_line": 56, "statements": [{ "kind": "assignment", "id": 0, "source_line": 57, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 57, "signal_id": 1 } }] }, "elif_chain": [{ "kind": "if", "source_line": 58, "condition": { "kind": "binary_eq", "width": 1, "source_line": 58, "left": { "kind": "signal_ref", "width": 2, "source_line": 58, "signal_id": 0 }, "right": { "kind": "literal", "width": 2, "source_line": 58, "literal": { "value": 1, "width": 2 } } }, "then": { "kind": "block", "source_line": 58, "statements": [{ "kind": "assignment", "id": 1, "source_line": 59, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 59, "signal_id": 2 } }] } }], "else": { "kind": "block", "source_line": 60, "statements": [{ "kind": "if", "source_line": 62, "condition": { "kind": "binary_gt", "width": 1, "source_line": 62, "left": { "kind": "signal_ref", "width": 8, "source_line": 62, "signal_id": 1 }, "right": { "kind": "signal_ref", "width": 8, "source_line": 62, "signal_id": 2 } }, "then": { "kind": "block", "source_line": 62, "statements": [{ "kind": "assignment", "id": 2, "source_line": 63, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 63, "signal_id": 1 } }] }, "else": { "kind": "block", "source_line": 64, "statements": [{ "kind": "assignment", "id": 3, "source_line": 65, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 3, "is_sliced": false, "rhs": { "kind": "literal", "width": 8, "source_line": 65, "literal": { "value": 255, "width": 8 } } }] } }] } }, { "kind": "select", "source_line": 71, "selector": { "kind": "signal_ref", "width": 2, "source_line": 71, "signal_id": 0 }, "cases": [{ "case_value": { "kind": "literal", "width": 2, "source_line": 72, "literal": { "value": 0, "width": 2 } }, "body": { "kind": "block", "source_line": 72, "statements": [{ "kind": "assignment", "id": 4, "source_line": 73, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 73, "literal": { "value": 0, "width": 1 } } }] } }, { "case_value": { "kind": "literal", "width": 2, "source_line": 75, "literal": { "value": 1, "width": 2 } }, "body": null }, { "case_value": { "kind": "literal", "width": 2, "source_line": 76, "literal": { "value": 2, "width": 2 } }, "body": { "kind": "block", "source_line": 76, "statements": [{ "kind": "assignment", "id": 5, "source_line": 77, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 77, "literal": { "value": 1, "width": 1 } } }] } }, { "case_value": null, "body": { "kind": "block", "source_line": 79, "statements": [{ "kind": "assignment", "id": 6, "source_line": 80, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 4, "is_sliced": false, "rhs": { "kind": "slice", "width": 1, "source_line": 80, "signal_id": 1, "msb": 0, "lsb": 0 } }] } }] }] }
      }
    ],
    "project": {
      "name": "ped_validation_project",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "mode_sel", "kind": "IN", "width": 2, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "data_a", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "data_b", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "result", "kind": "OUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 8, "drive": 8, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "status_led", "kind": "OUT", "width": 1, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "mode_sel", "bit_index": 0, "board_pin_id": "2" },
        { "logical_pin_name": "mode_sel", "bit_index": 1, "board_pin_id": "3" },
        { "logical_pin_name": "status_led", "bit_index": -1, "board_pin_id": "10" },
        { "logical_pin_name": "data_a", "bit_index": 0, "board_pin_id": "20" },
        { "logical_pin_name": "data_a", "bit_index": 1, "board_pin_id": "21" },
        { "logical_pin_name": "data_a", "bit_index": 2, "board_pin_id": "22" },
        { "logical_pin_name": "data_a", "bit_index": 3, "board_pin_id": "23" },
        { "logical_pin_name": "data_a", "bit_index": 4, "board_pin_id": "24" },
        { "logical_pin_name": "data_a", "bit_index": 5, "board_pin_id": "25" },
        { "logical_pin_name": "data_a", "bit_index": 6, "board_pin_id": "26" },
        { "logical_pin_name": "data_a", "bit_index": 7, "board_pin_id": "27" },
        { "logical_pin_name": "data_b", "bit_index": 0, "board_pin_id": "30" },
        { "logical_pin_name": "data_b", "bit_index": 1, "board_pin_id": "31" },
        { "logical_pin_name": "data_b", "bit_index": 2, "board_pin_id": "32" },
        { "logical_pin_name": "data_b", "bit_index": 3, "board_pin_id": "33" },
        { "logical_pin_name": "data_b", "bit_index": 4, "board_pin_id": "34" },
        { "logical_pin_name": "data_b", "bit_index": 5, "board_pin_id": "35" },
        { "logical_pin_name": "data_b", "bit_index": 6, "board_pin_id": "36" },
        { "logical_pin_name": "data_b", "bit_index": 7, "board_pin_id": "37" },
        { "logical_pin_name": "result", "bit_index": 0, "board_pin_id": "40" },
        { "logical_pin_name": "result", "bit_index": 1, "board_pin_id": "41" },
        { "logical_pin_name": "result", "bit_index": 2, "board_pin_id": "42" },
        { "logical_pin_name": "result", "bit_index": 3, "board_pin_id": "43" },
        { "logical_pin_name": "result", "bit_index": 4, "board_pin_id": "44" },
        { "logical_pin_name": "result", "bit_index": 5, "board_pin_id": "45" },
        { "logical_pin_name": "result", "bit_index": 6, "board_pin_id": "46" },
        { "logical_pin_name": "result", "bit_index": 7, "board_pin_id": "47" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": 0, "pin_id": 0, "pin_bit_index": 0 },
        { "top_port_signal_id": 0, "top_bit_index": 1, "pin_id": 0, "pin_bit_index": 1 },
        { "top_port_signal_id": 1, "top_bit_index": 0, "pin_id": 1, "pin_bit_index": 0 },
        { "top_port_signal_id": 1, "top_bit_index": 1, "pin_id": 1, "pin_bit_index": 1 },
        { "top_port_signal_id": 1, "top_bit_index": 2, "pin_id": 1, "pin_bit_index": 2 },
        { "top_port_signal_id": 1, "top_bit_index": 3, "pin_id": 1, "pin_bit_index": 3 },
        { "top_port_signal_id": 1, "top_bit_index": 4, "pin_id": 1, "pin_bit_index": 4 },
        { "top_port_signal_id": 1, "top_bit_index": 5, "pin_id": 1, "pin_bit_index": 5 },
        { "top_port_signal_id": 1, "top_bit_index": 6, "pin_id": 1, "pin_bit_index": 6 },
        { "top_port_signal_id": 1, "top_bit_index": 7, "pin_id": 1, "pin_bit_index": 7 },
        { "top_port_signal_id": 2, "top_bit_index": 0, "pin_id": 2, "pin_bit_index": 0 },
        { "top_port_signal_id": 2, "top_bit_index": 1, "pin_id": 2, "pin_bit_index": 1 },
        { "top_port_signal_id": 2, "top_bit_index": 2, "pin_id": 2, "pin_bit_index": 2 },
        { "top_port_signal_id": 2, "top_bit_index": 3, "pin_id": 2, "pin_bit_index": 3 },
        { "top_port_signal_id": 2, "top_bit_index": 4, "pin_id": 2, "pin_bit_index": 4 },
        { "top_port_signal_id": 2, "top_bit_index": 5, "pin_id": 2, "pin_bit_index": 5 },
        { "top_port_signal_id": 2, "top_bit_index": 6, "pin_id": 2, "pin_bit_index": 6 },
        { "top_port_signal_id": 2, "top_bit_index": 7, "pin_id": 2, "pin_bit_index": 7 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 },
        { "top_port_signal_id": 4, "top_bit_index": -1, "pin_id": 4, "pin_bit_index": -1 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 84 }
    ]
  }
}
