{
  "ir_version": "0.1.0",
  "design": {
    "name": "bus_passthrough_test",
    "modules": [
      {
        "id": 0,
        "name": "bus_test_top",
        "base_module_id": -1,
        "source_line": 52,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "addr",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 54,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "cmd",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 55,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "valid",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 56,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "data",
          "kind": "port",
          "width": 8,
          "owner_module_id": 0,
          "source_line": 57,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "INOUT" }
        },
        {
          "id": 4,
          "name": "done",
          "kind": "port",
          "width": 1,
          "owner_module_id": 0,
          "source_line": 58,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 5,
          "name": "src_bus",
          "kind": "net",
          "width": 19,
          "owner_module_id": 0,
          "source_line": 62,
          "can_be_z": false,
          "iob": false
        },
        {
          "id": 6,
          "name": "dst_bus",
          "kind": "net",
          "width": 19,
          "owner_module_id": 0,
          "source_line": 63,
          "can_be_z": false,
          "iob": false
        }
      ],
        "clock_domains": [
        ],
        "instances": [
          {
            "id": 0,
            "name": "pass0",
            "child_module_id": 2,
            "connections": [{ "parent_signal_id": 5, "child_port_id": 100000, "parent_msb": 7, "parent_lsb": 0 }, { "parent_signal_id": 5, "child_port_id": 100001, "parent_msb": 8, "parent_lsb": 8 }, { "parent_signal_id": 5, "child_port_id": 100002, "parent_msb": 9, "parent_lsb": 9 }, { "parent_signal_id": 5, "child_port_id": 100003, "parent_msb": 17, "parent_lsb": 10 }, { "parent_signal_id": 5, "child_port_id": 100004, "parent_msb": 18, "parent_lsb": 18 }, { "parent_signal_id": 6, "child_port_id": 100005, "parent_msb": 7, "parent_lsb": 0 }, { "parent_signal_id": 6, "child_port_id": 100006, "parent_msb": 8, "parent_lsb": 8 }, { "parent_signal_id": 6, "child_port_id": 100007, "parent_msb": 9, "parent_lsb": 9 }, { "parent_signal_id": 6, "child_port_id": 100008, "parent_msb": 17, "parent_lsb": 10 }, { "parent_signal_id": 6, "child_port_id": 100009, "parent_msb": 18, "parent_lsb": 18 }]
          },
          {
            "id": 1,
            "name": "sink0",
            "child_module_id": 3,
            "connections": [{ "parent_signal_id": 6, "child_port_id": 100000, "parent_msb": 7, "parent_lsb": 0 }, { "parent_signal_id": 6, "child_port_id": 100001, "parent_msb": 8, "parent_lsb": 8 }, { "parent_signal_id": 6, "child_port_id": 100002, "parent_msb": 9, "parent_lsb": 9 }, { "parent_signal_id": 6, "child_port_id": 100003, "parent_msb": 17, "parent_lsb": 10 }, { "parent_signal_id": 6, "child_port_id": 100004, "parent_msb": 18, "parent_lsb": 18 }, { "parent_signal_id": 4, "child_port_id": 1 }]
          },
          {
            "id": 2,
            "name": "source0",
            "child_module_id": 1,
            "connections": [{ "parent_signal_id": 0, "child_port_id": 0 }, { "parent_signal_id": 1, "child_port_id": 1 }, { "parent_signal_id": 2, "child_port_id": 2 }, { "parent_signal_id": 3, "child_port_id": 3 }, { "parent_signal_id": 5, "child_port_id": 100000, "parent_msb": 7, "parent_lsb": 0 }, { "parent_signal_id": 5, "child_port_id": 100001, "parent_msb": 8, "parent_lsb": 8 }, { "parent_signal_id": 5, "child_port_id": 100002, "parent_msb": 9, "parent_lsb": 9 }, { "parent_signal_id": 5, "child_port_id": 100003, "parent_msb": 17, "parent_lsb": 10 }, { "parent_signal_id": 5, "child_port_id": 100004, "parent_msb": 18, "parent_lsb": 18 }]
          }
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": null
      },
      {
        "id": 1,
        "name": "bus_source",
        "base_module_id": -1,
        "source_line": 86,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 0,
          "name": "addr",
          "kind": "port",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 88,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 1,
          "name": "cmd",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 89,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 2,
          "name": "valid",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 90,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 3,
          "name": "data",
          "kind": "port",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 91,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "INOUT" }
        },
        {
          "id": 100000,
          "name": "pbus_ADDR",
          "kind": "port",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 35,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100001,
          "name": "pbus_CMD",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 36,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100002,
          "name": "pbus_VALID",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 37,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100003,
          "name": "pbus_DATA",
          "kind": "port",
          "width": 8,
          "owner_module_id": 1,
          "source_line": 38,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "INOUT" }
        },
        {
          "id": 100004,
          "name": "pbus_DONE",
          "kind": "port",
          "width": 1,
          "owner_module_id": 1,
          "source_line": 39,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 95, "statements": [{ "kind": "assignment", "id": 0, "source_line": 96, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100000, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 96, "signal_id": 0 } }, { "kind": "assignment", "id": 1, "source_line": 97, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100001, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 97, "signal_id": 1 } }, { "kind": "assignment", "id": 2, "source_line": 98, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100002, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 98, "signal_id": 2 } }, { "kind": "assignment", "id": 3, "source_line": 99, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100003, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 99, "signal_id": 3 } }] }
      },
      {
        "id": 2,
        "name": "bus_passthrough",
        "base_module_id": -1,
        "source_line": 104,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 100000,
          "name": "src_ADDR",
          "kind": "port",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 35,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100001,
          "name": "src_CMD",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 36,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100002,
          "name": "src_VALID",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 37,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100003,
          "name": "src_DATA",
          "kind": "port",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 38,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "INOUT" }
        },
        {
          "id": 100004,
          "name": "src_DONE",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 39,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100005,
          "name": "dst_ADDR",
          "kind": "port",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 35,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100006,
          "name": "dst_CMD",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 36,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100007,
          "name": "dst_VALID",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 37,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 100008,
          "name": "dst_DATA",
          "kind": "port",
          "width": 8,
          "owner_module_id": 2,
          "source_line": 38,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "INOUT" }
        },
        {
          "id": 100009,
          "name": "dst_DONE",
          "kind": "port",
          "width": 1,
          "owner_module_id": 2,
          "source_line": 39,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "IN" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 110, "statements": [{ "kind": "assignment", "id": 0, "source_line": 112, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100005, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 112, "signal_id": 100000 } }, { "kind": "assignment", "id": 1, "source_line": 113, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100006, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 113, "signal_id": 100001 } }, { "kind": "assignment", "id": 2, "source_line": 114, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100007, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 114, "signal_id": 100002 } }, { "kind": "assignment", "id": 3, "source_line": 115, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100008, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 8, "source_line": 115, "signal_id": 100003 } }, { "kind": "assignment", "id": 4, "source_line": 116, "assignment_kind": "ASSIGN_ALIAS", "lhs_signal_id": 100009, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 116, "signal_id": 100004 } }] }
      },
      {
        "id": 3,
        "name": "bus_sink",
        "base_module_id": -1,
        "source_line": 121,
        "source_file": "test.jz",
      "signals": [
        {
          "id": 100000,
          "name": "pbus_ADDR",
          "kind": "port",
          "width": 8,
          "owner_module_id": 3,
          "source_line": 35,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100001,
          "name": "pbus_CMD",
          "kind": "port",
          "width": 1,
          "owner_module_id": 3,
          "source_line": 36,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100002,
          "name": "pbus_VALID",
          "kind": "port",
          "width": 1,
          "owner_module_id": 3,
          "source_line": 37,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "IN" }
        },
        {
          "id": 100003,
          "name": "pbus_DATA",
          "kind": "port",
          "width": 8,
          "owner_module_id": 3,
          "source_line": 38,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "INOUT" }
        },
        {
          "id": 100004,
          "name": "pbus_DONE",
          "kind": "port",
          "width": 1,
          "owner_module_id": 3,
          "source_line": 39,
          "can_be_z": true,
          "iob": false,
          "port": { "direction": "OUT" }
        },
        {
          "id": 1,
          "name": "done_flag",
          "kind": "port",
          "width": 1,
          "owner_module_id": 3,
          "source_line": 124,
          "can_be_z": false,
          "iob": false,
          "port": { "direction": "OUT" }
        }
      ],
        "clock_domains": [
        ],
        "instances": [
        ],
        "memories": [
        ],
        "cdc_crossings": [
        ],
        "async_block": { "kind": "block", "source_line": 127, "statements": [{ "kind": "assignment", "id": 0, "source_line": 128, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100003, "is_sliced": false, "rhs": { "kind": "ternary", "width": 8, "source_line": 128, "condition": { "kind": "logical_and", "width": 1, "source_line": 128, "left": { "kind": "binary_eq", "width": 1, "source_line": 128, "left": { "kind": "signal_ref", "width": 1, "source_line": 128, "signal_id": 100002 }, "right": { "kind": "literal", "width": 1, "source_line": 128, "literal": { "value": 1, "width": 1 } } }, "right": { "kind": "binary_eq", "width": 1, "source_line": 128, "left": { "kind": "signal_ref", "width": 1, "source_line": 128, "signal_id": 100001 }, "right": { "kind": "literal", "width": 1, "source_line": 128, "literal": { "value": 1, "width": 1 } } } }, "true": { "kind": "literal", "width": 8, "source_line": 128, "literal": { "value": 170, "width": 8 } }, "false": { "kind": "literal", "width": 8, "source_line": 128, "literal": { "value": 0, "width": 8, "is_z": true } } } }, { "kind": "assignment", "id": 1, "source_line": 129, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 1, "is_sliced": false, "rhs": { "kind": "signal_ref", "width": 1, "source_line": 129, "signal_id": 100002 } }, { "kind": "assignment", "id": 2, "source_line": 130, "assignment_kind": "ASSIGN_RECEIVE", "lhs_signal_id": 100004, "is_sliced": false, "rhs": { "kind": "literal", "width": 1, "source_line": 130, "literal": { "value": 1, "width": 1 } } }] }
      }
    ],
    "project": {
      "name": "bus_passthrough_test",
      "clocks": [
      ],
      "clock_gens": [
      ],
      "pins": [
        { "id": 0, "name": "addr_in", "kind": "IN", "width": 8, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 1, "name": "cmd_in", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 2, "name": "valid_in", "kind": "IN", "width": 1, "standard": "LVCMOS33", "drive_ma": -1, "drive": -1, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 3, "name": "data_io", "kind": "INOUT", "width": 8, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" },
        { "id": 4, "name": "done_out", "kind": "OUT", "width": 1, "standard": "LVCMOS33", "drive_ma": 4, "drive": 4, "mode": "SINGLE", "term": false, "pull": "NONE" }
      ],
      "mappings": [
        { "logical_pin_name": "addr_in", "bit_index": 0, "board_pin_id": "10" },
        { "logical_pin_name": "addr_in", "bit_index": 1, "board_pin_id": "11" },
        { "logical_pin_name": "addr_in", "bit_index": 2, "board_pin_id": "12" },
        { "logical_pin_name": "addr_in", "bit_index": 3, "board_pin_id": "13" },
        { "logical_pin_name": "addr_in", "bit_index": 4, "board_pin_id": "14" },
        { "logical_pin_name": "addr_in", "bit_index": 5, "board_pin_id": "15" },
        { "logical_pin_name": "addr_in", "bit_index": 6, "board_pin_id": "16" },
        { "logical_pin_name": "addr_in", "bit_index": 7, "board_pin_id": "17" },
        { "logical_pin_name": "cmd_in", "bit_index": -1, "board_pin_id": "20" },
        { "logical_pin_name": "valid_in", "bit_index": -1, "board_pin_id": "21" },
        { "logical_pin_name": "data_io", "bit_index": 0, "board_pin_id": "30" },
        { "logical_pin_name": "data_io", "bit_index": 1, "board_pin_id": "31" },
        { "logical_pin_name": "data_io", "bit_index": 2, "board_pin_id": "32" },
        { "logical_pin_name": "data_io", "bit_index": 3, "board_pin_id": "33" },
        { "logical_pin_name": "data_io", "bit_index": 4, "board_pin_id": "34" },
        { "logical_pin_name": "data_io", "bit_index": 5, "board_pin_id": "35" },
        { "logical_pin_name": "data_io", "bit_index": 6, "board_pin_id": "36" },
        { "logical_pin_name": "data_io", "bit_index": 7, "board_pin_id": "37" },
        { "logical_pin_name": "done_out", "bit_index": -1, "board_pin_id": "40" }
      ],
      "top_module_id": 0,
      "top_bindings": [
        { "top_port_signal_id": 0, "top_bit_index": 0, "pin_id": 0, "pin_bit_index": 0 },
        { "top_port_signal_id": 0, "top_bit_index": 1, "pin_id": 0, "pin_bit_index": 1 },
        { "top_port_signal_id": 0, "top_bit_index": 2, "pin_id": 0, "pin_bit_index": 2 },
        { "top_port_signal_id": 0, "top_bit_index": 3, "pin_id": 0, "pin_bit_index": 3 },
        { "top_port_signal_id": 0, "top_bit_index": 4, "pin_id": 0, "pin_bit_index": 4 },
        { "top_port_signal_id": 0, "top_bit_index": 5, "pin_id": 0, "pin_bit_index": 5 },
        { "top_port_signal_id": 0, "top_bit_index": 6, "pin_id": 0, "pin_bit_index": 6 },
        { "top_port_signal_id": 0, "top_bit_index": 7, "pin_id": 0, "pin_bit_index": 7 },
        { "top_port_signal_id": 1, "top_bit_index": -1, "pin_id": 1, "pin_bit_index": -1 },
        { "top_port_signal_id": 2, "top_bit_index": -1, "pin_id": 2, "pin_bit_index": -1 },
        { "top_port_signal_id": 3, "top_bit_index": 0, "pin_id": 3, "pin_bit_index": 0 },
        { "top_port_signal_id": 3, "top_bit_index": 1, "pin_id": 3, "pin_bit_index": 1 },
        { "top_port_signal_id": 3, "top_bit_index": 2, "pin_id": 3, "pin_bit_index": 2 },
        { "top_port_signal_id": 3, "top_bit_index": 3, "pin_id": 3, "pin_bit_index": 3 },
        { "top_port_signal_id": 3, "top_bit_index": 4, "pin_id": 3, "pin_bit_index": 4 },
        { "top_port_signal_id": 3, "top_bit_index": 5, "pin_id": 3, "pin_bit_index": 5 },
        { "top_port_signal_id": 3, "top_bit_index": 6, "pin_id": 3, "pin_bit_index": 6 },
        { "top_port_signal_id": 3, "top_bit_index": 7, "pin_id": 3, "pin_bit_index": 7 },
        { "top_port_signal_id": 4, "top_bit_index": -1, "pin_id": 4, "pin_bit_index": -1 }
      ]
    },
    "source_files": [
      { "path": "test.jz", "line_count": 132 }
    ]
  }
}
